[
    {
        "Name": "Rebekah's Apple Cinnamon Muffins",
        "Ingredients": [
            "3/4 cup vegetable oil (can use 1/2 applesauce)",
            "1 cup sugar",
            "1 tsp vanilla",
            "2 cups flour",
            "3/4 t baking soda",
            "3/4 t cinnamon",
            "1/2 t salt",
            "1.5 cups diced apples",
            "Optional: 1/2 cup raisins; 1/2 cup chopped walnuts"
        ],
        "Directions": [
            "Preheat oven to 400F. Grease muffin tin.",
            "In a large bowl, beat oil and sugar together. Add eggs and vanilla and mix more.",
            "In a separate bowl, mix together the flour, baking soda, cinnamon, and salt",
            "Add the dry ingredients to the oil mixture and stir until just combined. It may be very thick, almost like cookie dough",
            "Add in the apples and anything else. If it's still really crumbly, add a little bit of water, but it should still be pretty thick. You'll be able to shape it with your hands.",
            "Bake 20-25 minutes. These muffins freeze well."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Da's Coffee Cake",
        "Ingredients": [
            "1.5 cups flour",
            "1/4 t salt",
            "2 t baking powder",
            "1/4 cup butter",
            "1/4 to 1/2 cup sugar",
            "Equivalent of 1 egg (1 T flaxmeal plus 2.5 T water)",
            "cup milk",
            "1/2 t vanilla extract",
            "Streusel:",
            "1/4 cup flour",
            "1/4 cup butter (not margarine. Must be cold, not melted, and solid)",
            "1/2 cup sugar",
            "1 t cinnamon",
            "1 cup chopped nuts (optional)"
        ],
        "Directions": [
            "Preheat oven to 375F.",
            "Sift together the flour, salt, and baking powder",
            "Cream the butter and sugar together in a separate bowl until fluffy",
            "Add the egg replacement and milk to the sugar and butter",
            "Add all of it together, and also the vanilla",
            "Stir until smooth. Spread into a greased pan",
            "Streusel:",
            "Combine all ingredients together to form a crumble",
            "Spread the streusel over the batter. Bake for 25 minutes uncovered."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Ma's Cranberry-Orange Muffins",
        "Ingredients": [
            "2 cups all-purpose flour",
            "1 cup sugar, divided",
            "1.5 t baking powder",
            "1 t salt",
            "1/2 t baking soda",
            "2 t grated orange rind",
            "3/4 cup orange juice (about one large orange)",
            "1/4 cup canola oil",
            "1 flaxegg (1 T flaxmeal + 2.5 T water, let sit 5 min)",
            "2 cups coarsely chopped fresh cranberries (about 8 oz)",
            "cup chopped walnuts, toasted"
        ],
        "Directions": [
            "Combine flour, 1 cup sugar minus 1 T, baking powder, salt, and baking soda in a large bowl",
            "Make well in center of mixture",
            "Combine rind, juice, oil, and flaxegg in a small bowl, stirring well with a whisk. Add to flour mixture",
            "Fold in cranberries and walnuts. Spoon batter into 16 muffin cups coated with cooking spray.",
            "Sprinkle evenly with reserved sugar (1 T)",
            "Bake at 400F for 15 minutes or until the muffins spring back when touched lightly in center."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cranberry Nut Bread",
        "Ingredients": [
            "2 T ground flax plus 6 T water to replace 2 eggs (or other egg replacer)",
            "2 1/2 cups flour",
            "1 cup sugar",
            "1 cup coarsely chopped fresh cranberries",
            "1 cup raisins",
            "1/2 cup coarsely chopped walnuts",
            "1 T baking powder",
            "2 tsp grated orange zest",
            "1/4 tsp salt",
            "3/4 cup orange juice",
            "1/2 cup veganaise (I've used mock sour cream in a pinch)"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Fluffy Pancakes",
        "Ingredients": [
            "1 cup flour",
            "1 tablespoon baking powder",
            "1/4 teaspoon salt",
            "1 cup dairy-free milk",
            "2 tablespoons oil",
            "2 tablespoons maple syrup or sugar (optional)",
            "1 teaspoon vanilla extract"
        ],
        "Directions": [
            "Mix together the flour, baking powder and salt.",
            "Mix together the milk, oil, maple syrup and vanilla extract in a separate bowl",
            "Pour the liquid mixture into the dry mixture. Stir until combined, so only a few lumps remain (don't over-mix or your pancakes will be tough!)"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Granola",
        "Ingredients": [
            "3 cups oats",
            "1/2 cup shredded unsweetened coconut",
            "2 t cinnamon",
            "1 t salt",
            "1 cup nuts",
            "1 cup seeds (sunflower or pumpkin)",
            "1/2 cup millet",
            "1/2 cup maple syrup",
            "1 t vanilla",
            "2 T melted coconut oil"
        ],
        "Directions": [
            "Mix all ingredients",
            "Bake at 325 on two baking sheets lined with parchment. Bake for 20 minutes, stir, then bake for about 15 minutes more.",
            "Can add chia, flax, or hemp seeds after done cooking."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chartwell's Tofu Scramble",
        "Ingredients": [
            "6 packages firm tofu",
            "1 large Spanish onion - small dice",
            "3/4 cup of coarsely chopped whole peeled garlic",
            "1/2 cup of smart balance",
            "1 T of turmeric",
            "1 t salt",
            "1/2 t pepper",
            "1.5 cups nutritional yeast"
        ],
        "Directions": [
            "Drain tofu well",
            "Add spices and nooch and stir"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Tofu-Spinach Scramble",
        "Ingredients": [
            "1 package extra-firm tofu",
            "1 t olive oil or 1/4 cup veggie broth",
            "1 small yellow onion, diced",
            "3 cloves minced garlic",
            "3 large celery stalks, chopped",
            "2 large carrots, chopped",
            "1 t chili powder",
            "1/2 t cumin",
            "1/2 t turmeric",
            "1/2 t salt",
            "1/4 t black pepper",
            "5 cups loosely packed spinach"
        ],
        "Directions": [
            "Press and drain the tofu",
            "Crumble the tofu with your hands and set aside",
            "Saute onion, garlic, celery, and carrots until onion is softened",
            "Add the tofu and spices and continue to cook until the tofu begins to brown",
            "Add the spinach and mix. Cover, reduce heat, steam spinach for 3 minutes"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Tortilla Breakfast Casserole",
        "Ingredients": [
            "1 recipe tofu spinach scramble (from above)",
            "1 can black beans, rinsed and drained",
            "1/4 cup nutritional yeast",
            "1 t hot sauce",
            "10 small corn tortillas",
            "1/2 cup shredded vegan cheddar or pepper jack cheese, divided"
        ],
        "Directions": [
            "Preheat oven to 350F. Coat a 9x9 baking pan with cooking spray.",
            "In a bowl, combine the tofu scramble with the beans, nooch, and hot sauce. Set aside.",
            "In the bottom of the baking pan, place 5 corn tortillas.Spread half of the tofu and bean mixture over the tortillas. Spread 1/4 cup of cheese over the top. Layer the remaining 5 tortillas over the cheese. Spread the remainder of the tofu and bean mixture over the tortillas. Spread the remaining 1/4 cup cheese over the top.",
            "Bake for 20 minutes."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Ma's Oatmeal Scones (Recommended)",
        "Ingredients": [
            "1.5 cup whole wheat pastry flour",
            "2 cups flour",
            "3/4 cup sugar",
            "3/4 t salt",
            "1 t baking soda",
            "2.5 t baking powder",
            "2.5 sticks unsalted butter cut into bits",
            "2.5 cups oatmeal",
            "1 cup chopped dried cranberries or other dried fruits and/or nuts",
            "cup buttermilk (see buttermilk recipe in Toppings, Sauces, and Sides)"
        ],
        "Directions": [
            "Blend the flour through butter in a food processor until coarsely blended.",
            "Pour into large bowl and add the rest of the ingredients.",
            "Mix until just blended. Form into a long, flat log. Divide into five sections and cut each section in half diagonally.",
            "If not ready to bake, wrap them and freeze the dough.",
            "When ready to bake place on baking sheet with silicon mat and bake at 350F for 30-40 minutes."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "New Year's Cinnamon Rolls",
        "Ingredients": [
            "2.5 cups non-dairy milk, lukewarm",
            "2 t sugar",
            "80 grams fresh yeast or 4 t active dry yeast or 4 t instant yeast",
            "6 ? cups all-purpose flour",
            "4 t baking powder",
            "3 t salt",
            "1/2 t lemon juice",
            "4 T + 1 t oil",
            "Filling:",
            "1/4 cup white sugar",
            "6 T butter, melted",
            "1/2 cup brown sugar",
            "1 T cinnamon",
            "Walnuts, raisins, etc - optional",
            "Glaze:",
            "3 T butter, melted",
            "1.5 T vegan cream",
            "3/4 cup powdered sugar",
            "1 t vanilla extract"
        ],
        "Directions": [
            "If you're using instant yeast, mix it directly with flour. For other types of yeast in a small bowl combine lukewarm milk with sugar and yeast. Let stand until yeast activates, about 10 minutes. The yeast will become foamy and start expanding.",
            "Put the yeast mixture together with the remaining ingredients in a bowl of your food processor or mixer. Mix well until you get soft dough, similar to pizza dough. If the dough seems too dry (depending on the kind of flour you're using), add a little bit more milk or water. If it is too soft, add a little flour.",
            "Combine dough with white sugar. Roll on a floured surface into a rectangle, leaving 1/2 inch border on the long sides.",
            "Spread with 6 T melted butter and sprinkle with brown sugar and cinnamon. Can also add walnuts, raisins, and whatever else you like. Starting at a long edge, roll dough into log.",
            "With seam side down, cut roll with a thin sharp knife into 15-16, 1 inch slices. Place slices in a buttered pan. Let rise in a warm place about 20-25 minutes or until almost double in size.",
            "Bake in preheated 350F oven for about 20-30 minutes or until tops are golden.",
            "Remove cinnamon rolls from oven and invert onto rack. Let cool a bit.",
            "Glaze: In a small bowl, combine 3 T melted butter, cream, powdered sugar, and vanilla. Drizzle glaze over rolls."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Aunt Cris' Banana Bread",
        "Ingredients": [
            "3 bananas, mashed",
            "2 T flaxmeal + 5 T of water. Mix and let sit for a few minutes",
            "2 cups flour",
            "3/4 cup sugar",
            "1 t baking soda",
            "1 t salt",
            "1/2 cup walnuts"
        ],
        "Directions": [
            "Bake at 350. Grease loaf pan. Mix bananas and flaxmeal. Stir in flour, sugar, salt, and baking soda. Add nuts. Bake 45-1 hour."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Leslie Raney's Zucchini Bread",
        "Ingredients": [
            "Makes 2 loaves",
            "3 T flaxmeal + 7.5 T water (let sit)",
            "3 cups flour",
            "2 cups sugar",
            "3 cups shredded zucchini (I squeeze out some of the water but not all of it)",
            "3/4 cup oil",
            "1.5 t cinnamon",
            "1 t salt",
            "1 t baking soda",
            "1 t baking powder",
            "1/2 walnuts and/or raisins"
        ],
        "Directions": [
            "Bake at 350 for one hour."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Plain Bread",
        "Ingredients": [
            "3 cups flour",
            "1 t salt",
            "1/2 t yeast",
            "1.5 cups warm water (110 degrees if possible)"
        ],
        "Directions": [
            "In a bowl, stir the flour, salt, yeast, and water until combined.",
            "Cover with plastic wrap and set at room temperature for 8-24 hours.",
            "Turn dough out onto well floured surface and form a ball. Rest for 30 minutes.",
            "In the meantime, place baking dish with high sides into the oven and preheat to 450 degrees.",
            "Slash X on top of bread. Carefully transfer to baking dish and cover. Bake 30 minutes; uncover and bake 10-15 minutes more until golden brown. Cool before slicing."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Whole Wheat Sandwich Bread",
        "Ingredients": [
            "1 T yeast",
            "2.5 cups warm water (110 degrees if possible)",
            "2 T molasses (I found this was too much)",
            "2 T maple syrup",
            "1 T coarse salt or 2 t table salt",
            "1/4 cup oil or melted butter",
            "6 cups whole wheat flour"
        ],
        "Directions": [
            "In a large bowl dissolve the yeast in 1/2 cup of the warm water",
            "Stir in the molasses, maple syrup, salt, butter or oil, the remaining water and the flour, cup by cup, until the dough becomes hard to stir.",
            "Turn the dough out, using the same flour to dust your work surface. Let rest while you clean out and grease your bowl.",
            "Knead the dough, adding more of the same flour as required, until it becomes smooth and loses most of its tackiness-about 8-10 minutes (or like 3, you know).",
            "Return it to the greased bowl and cover with plastic wrap. Let rise until almost double its volume-2 hours or more.",
            "Punch the dough down, then shape it into two loaves and place in greased bread pans (I found greased/buttered PLUS floured works best).",
            "Cover lightly with a towel and let rise until the dough almost reaches the top of the pans, about 1 hour or so.",
            "Bake in a preheated 350 degrees oven for 45 minutes. Remove the loaves and cool on racks. COOL COMPLETELY BEFORE SLICING."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "French Bread",
        "Ingredients": [
            "1/4 C warm water 105-115 degrees",
            "1 pkg dry active yeast",
            "1 tsp sugar",
            "4 C all purpose flour",
            "1 Tbsp sugar",
            "1 tsp salt",
            "1 C plus 2 Tbsp. warm water",
            "Aquafaba (optional)"
        ],
        "Directions": [
            "Combine 1/4 C water, yeast and 1 tsp sugar into a bowl.",
            "Allow to stand for 5 minutes until yeast is bubbly.",
            "Add in 1 Tbsp sugar, salt and water.",
            "Mix well.",
            "Add flour.",
            "Mix well and knead for 5 minutes or until dough is smooth.",
            "Allow to rise until double (about 15-20 minutes)",
            "On a lightly floured surface roll out with a rolling pin. (May divide dough into two pieces for two smaller loaves if desired)",
            "Roll dough up jelly roll style and turn ends under and place seam down on a greased",
            "cookie sheet. Cut 3 diagonal slits into each loaf (only about 1/4 inch deep)",
            "Gently brush aquafaba on loaves (optional).",
            "Preheat oven to 300 degrees.",
            "Boil a pan of water and then put it into a shallow dish.",
            "TURN OFF OVEN",
            "Place pan of water on lower rack and then bread on shelf above pan of water.",
            "Allow to rise until double (about 20 minutes)",
            "Remove pan of water",
            "Leave bread in the oven and turn oven to 425 degrees and bake bread for 10 minutes. (this includes the preheating time)",
            "Reduce oven to 375  after ten minutes and continue to bake for 6-8 minutes longer or until bread is golden brown."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Rosemary Bread",
        "Ingredients": [
            "2 1/4 t dry active yeast",
            "2 t sugar",
            "1 T olive oil",
            "2 1/2 cup flour",
            "1.5 T dried rosemary",
            "1 t salt"
        ],
        "Directions": [
            "Stir the yeast, sugar and 1/4 cup warm water in a lar ge bowl (or in the bowl of a stand mixer). Let sit until foamy, about 5 minutes.",
            "Add 1 tablespoon olive oil, the flour, rosemary, the fine salt and 3/4 cup warm water; stir with a wooden spoon (or with the dough hook if using a mixer) until a dough forms.",
            "Cover with plastic wrap and let stand at room temperature until more than doubled, about 2 hours.",
            "Brush 2 baking sheets with olive oil. Generously flour a work surface; turn the dough out onto the flour and divide into 2 pieces. Working with one piece at a time, sprinkle some flour on the dough, then fold the top and bottom portions into the middle. Fold in the sides to make a free-form square. Use a spatula to turn the dough over, then tuck the corners under to form a ball. Place seam-side down on a prepared baking sheet. Repeat with the remaining dough, putting 2 balls on each baking sheet. Let stand, uncovered, until more than doubled, about 2 hours.",
            "Preheat the oven to 400 degrees F. Bake the loaves 10 minutes; brush with some olive oil and sprinkle with the kosher salt and some more rosemary. Continue baking until golden brown, about 20 more minutes. Transfer to a rack to cool"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Rye Bread (Recommended)",
        "Ingredients": [
            "1/2 cup warm water",
            "1 1/2 T active dry yeast",
            "1 cup milk",
            "2 t salt",
            "2 T oil",
            "2 1/2 - 3 cups bread flour",
            "1 1/2 cups rye flour",
            "2 T whole caraway seeds (optional)"
        ],
        "Directions": [
            "In a bowl, combine all the dry ingredients, mix around, and then add the wet ingredients.",
            "Knead for a while, like 10 minutes, adding bread flour if it's sticky",
            "Place the dough in a large bowl that's a bit wet and cover with a towel or something. Let the dough rise in a warm place until doubled in size, about 1 1/2 hours",
            "When the dough has risen, punch it down and transfer to a clean work surface. Let it rest for 5 minutes then shape it into a loaf and transfer to a baking sheet lined with parchment paper.",
            "Cover with a towel and let rise for another hour until doubled in size again. When the dough is close to being double in size, preheat the oven to 425F. Slash the dough with a sharp knife to create gashes on top.",
            "Open the oven a throw a few ice cubes on the bottom when you place the bread into bake (I just put a dish with water on the rack  underneath instead). This will create the steam that will make for a great crust to the bread. Bake for 30 minutes until crusty and golden brown."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Challah (Recommended)",
        "Ingredients": [
            "1 1/4 cups lukewarm water",
            "2 1/2 teaspoons active dry yeast",
            "6 tablespoons sugar",
            "1/4 cup oil (neutral-flavored such as grapeseed or canola, plus additional for oiling the bowl)",
            "4 to 4 1/2 cups all-purpose flour",
            "2 teaspoons salt (kosher salt or pink Himalayan sea salt)"
        ],
        "Directions": [
            "Place the warm water in a large bowl or stand mixer. Add a pinch of the sugar to the bowl, and sprinkle with the yeast. Set aside in a warm place for 5 to 10 minutes, until the mixture is foamy. (If your yeast doesn't proof properly, discard the mixture and start again with fresh yeast).",
            "Mix in the sugar, oil, 2 cups of flour, and salt. Add the remaining flour 1 cup at a time, mixing well after each addition until a shaggy dough forms and begins to pull into a ball. (You might or might not need the last 1/2 cup of flour. If the dough is very wet or sticky, add it. If not, use some of it to dust your work surface). NOTE: Mira says to make it yellow, you can add a bit of turmeric (because egg usually makes challah yellow).",
            "Turn the dough out onto a lightly floured work surface. With clean, floured hands, knead the dough until it is smooth and elastic, about 3 minutes. NOTE: Mira recommends only kneading for as long as it takes to make a ball that holds its shape. Allow the dough to rest for a few minutes while you clean and dry the large mixing bowl. Grease the inside of the bowl with a bit of oil. Place the challah dough in the bowl and turn to coat with the oil. Cover the bowl with a damp tea towel or plastic wrap and set aside in a warm place until the dough has risen to at least double its bulk, about 1 hour and 45 minutes.",
            "Punch the dough down. Lightly grease one or two baking sheets, or line with parchment paper. Shape or braid the dough as desired. (The recipe will make 1 large challah, 2 medium challahs, 1 medium challah plus 6 challah rolls, or 12 challah rolls.)",
            "Place the shaped challah and/or rolls on the baking sheet(s) and cover with clean, dry tea towels. Allow to rise until doubled, about 45 minutes to 1 hour.",
            "Heat the oven to 350 F. Bake the challah until the crust is a deep golden brown, and the loaf sounds hollow when tapped, about 30 to 35 minutes for a large challah, 20 to 25 minutes for a medium challah, and 15 to 20 minutes for rolls. Cool on a wire rack."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Bagels for the Commune",
        "Ingredients": [
            "2 tsp active dry yeast",
            "1 1/2 cups warm water",
            "3 1/2 cups (500g) bread flour + more for kneading OR all purpose flour (bread flour recommended but not essential)",
            "1 1/2 tsp salt",
            "1/4 cup plant milk",
            "Toppings (poppy seeds, toasted onion, vegan cheese, sesame seeds, etc)"
        ],
        "Directions": [
            "Mix the yeast, flour, and salt in a large bowl. Add the warm water. Mix well until a smooth dough forms. If it is too dry, add a bit more water (careful - only add a little at a time). If it is too wet, add some more flour. If you want to add anything to the dough like sesame seeds, now's the time. **If you want to add cranberries, now is the time. (see variation #1 below)",
            "Flour a countertop or large cutting board, and knead the dough for 10 minutes, or until it is smooth and elastic.",
            "Wet the inside of a clean large non-metal bowl with water, place the dough inside, and turn to coat until the outside is moist. Cover with a damp dish towel and set it to rise in a warm place for 1 hour, or until it has doubled in size. Once risen, punch down the dough and take out of bowl.",
            "Cover a baking sheet with silicone baking mat or parchment paper and set aside. Remove the dough from the bowl, and divide the dough into 8 pieces. Roll each piece into a ball.",
            "Now here's what I've discovered you should do: take the balls and pinch in the sides underneath, so the top gets really round and perfect. Then place the ball on the table with the bottom side down and form a lose cup shape with your hand and then roll your hand around the ball, careful not to squish the top - this will help even out the bottom. Once you've done this, you should set it aside to rise for like 10 minutes. Then after that, use your thumb to press down in the center. Then pick it up and use your thumb and pointer finger to make a hole, and then use both your pointer fingers to stretch out the hole evenly. If you only stretch it out a little bit, you'll end up with bagels that don't have much of a hole, which is fine. The more you stretch it out, the uglier it gets, though. So I like to stretch it out enough that it has a definite hole, but not too much. The bagels will expand when you boil them.",
            "Once the water has boiled, reduce the heat to medium, and use a slotted spoon to lower as many bagels that fit comfortably into the water (I do four and use two pots so I have eight going at once). Once they float to the top (a couple seconds), boil for 2 minutes, flip, then boil for another 2 minutes. For less chewiness, boil for less time. I tend not to time it and it always works out.",
            "Once all the bagels have boiled, transfer them to your lined baking sheet. Brush the dough with milk, and sprinkle with your seasoning. I worry about my bagels being too wet, so I usually transfer them to a baking sheet lined with a towel first, let them dry for a sec, then use my hands to rub milk on the tops (I don't have a brush), and then I transfer them to a baking sheet with the silicon mat and put the toppings on. The faster you put the toppings on, the better, because more will stick. Actually, scratch that - put the toppings on first, and then the milk. The stickiness of the bagels right after they've been boiled is ideal for getting the toppings to stick. And the way we've discovered to do this is to get a bowl that's not much bigger than the bagel and fill it with some seasoning, and then place the bagel upside down in it (it'll be hot, be careful) and swirl it around a bit so the seasoning coats the top and the sides.",
            "Bake the bagels 20 minutes, or until golden brown. (I consistently do 22 minutes). Remove from oven and cool on a wire rack.",
            "Wait until they are COMPLETELY cooled to put them in a container or bag. I would also wait until they are cool to cut them, if you're going to pre-cut them.",
            "If you aren't going to eat them all in the next few days (or next one day, if you live somewhere humid), then freeze them. There are no preservatives, they won't stay good long.",
            "Note: Most bagel recipes call for the bagels to be boiled with honey. I tried it with dandelion honey (recipe on this doc) and I couldn't tell much of a difference.",
            "Variation #1 from Jen: add 1 cup coarsely chopped fresh cranberries and a teaspoon of lemon zest right after the mixture has incorporated the water. You will have to decrease the water by some amount, maybe half a cup, maybe more, because of the wetness of the cranberries.",
            "Variation #2 from Sarah: add like 5 fresh chopped jalapenos into dough like 8 minutes into kneading. I added seeds and all but next time I might take seeds out cause they were weird to encounter in the cooked bagels. Topped with cheese before cooking. Very, very good."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Flatbread Stuffed with Fried Onion, Oregano, and Sumac",
        "Ingredients": [
            "Dough:",
            "2.5 cups bread flour",
            "1 1/4 cup lukewarm water",
            "2 t active dry yeast",
            "1 scant tablespoon sea salt",
            "Filling:",
            "1/4 cup olive oil",
            "1 large onion, diced",
            "1 cup oregano leaves; reserve 1 spoonful for garnish",
            "1 T ground sumac",
            "Salt",
            "3 cups olive oil"
        ],
        "Directions": [
            "Dough",
            "Combine all the ingredients in a large bowl of a stand mixer fitted with a bread hook. Mix on low speed until the ingredients are combined and a ball starts to form. Then increase the speed to medium and mix until the dough is smooth and elastic, 10-15 minutes. Cover the dough with a damp towel and let rise in a warm, draft-free area until doubled in volume, about 1 hour.",
            "Punch dough down and divide it into 5 balls. Arrange balls on a baking sheet, cover with a towel, and let rise for 30 minutes",
            "Filling",
            "Heat 1/4 cup olive oil in a skillet over medium heat. Add the onion and saute until soft and golden, about 15 minutes. Stir in the oregano and sumac. Remove from heat and cool completely. Season with salt.",
            "Assembly",
            "Place a ball of dough on a lightly floured surface. Using the heel of one hand, flatten and stretch dough into a rectangle. Lightly dust a rolling pin with flour and roll dough out into a 3x8 rectangle. Spread a fifth of the filling onto the rectangle, then fold into an envelope. Roll dough into 3x8 rectangle with a 1/4 inch thickness. Cute ach rectangle in half then in half again to form 4 triangles. Repeat with remaining dough balls and filling.",
            "To fry",
            "Heat the 3 cups olive oil to 375F in a large heavy pot. Add triangles of dough (in batches, do not crowd) and fry until puffed and golden brown, about 3 minutes per side. Remove from oil using a slotted utensil and drain on towels. Serve immediately."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Hamburger Buns",
        "Ingredients": [
            "1 tablespoon active dry yeast",
            "1/2 cup warm water",
            "2 tablespoons organic cane sugar",
            "1/2 cup non-dairy milk (I used homemade almond milk)",
            "1 flax egg (1 tbs ground flax seeds + 3 tbs water)",
            "2 tablespoons organic coconut oil (melted/liquid)",
            "1 teaspoon pink himalayan salt",
            "3 cups all-purpose organic unbleached flour",
            "Optional",
            "1 tablespoon organic coconut oil or vegan butter (melted - to brush over the tops)",
            "sesame seeds"
        ],
        "Directions": [
            "In the bowl of a standing mixer, stir the yeast into the warm water and let it sit until dissolved.",
            "In a separate bowl, whisk together the non-dairy milk, flax egg, coconut oil, sugar and pink himalayan salt.",
            "Add this to the yeast mixture and stir until well combined.",
            "Add all the flour mixture and stir until it forms a shaggy dough.",
            "Knead at low speed for 10 minutes (The finished dough should be smooth, feel slightly tacky and spring back when poked).",
            "Cover and let the dough rise in a warm spot until doubled in size (approximately one hour).",
            "Dust your work area with a little flour and turn out the risen dough on top.",
            "Divide the dough into 8 pieces and shape each piece into a tight ball.",
            "Transfer the balls onto a baking sheet and let them rise until they look puffy and hamburger-sized (approximately 30 - 40 minutes).",
            "Melt the butter and brush it over the risen hamburger buns (This helps the tops to brown and keeps the crust soft).",
            "Bake the buns at 375 degrees for approximately 15 - 18 minutes (or until golden on the tops).",
            "Let the buns cool at room temperature before slicing and using."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Flour Tortillas & Tortilla Chips",
        "Ingredients": [
            "3 cups all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon baking powder",
            "cup extra virgin olive oil, vegetable oil or other fairly neutral flavored oil",
            "1 cup warm water"
        ],
        "Directions": [
            "Combine flour, salt and baking powder in the bowl of a stand mixer. Using a dough hook, mix dry ingredients until well combined.",
            "Add oil and water with mixer running at a medium speed. After about 1 minute, or when mixture comes together and begins to form a ball, decrease mixing speed to low. Continue to mix for 1 minute or until dough is smooth. Or just mix it by hand and then knead it for a few minutes.",
            "Transfer dough to a lightly floured work surface. Divide into 16 equal portions. Turn each piece to coat with flour. Form each piece into a ball and flatten with the palm of your hand. Cover flattened balls of dough with a clean kitchen towel and allow to rest for at least 15 minutes (or as much as 2 hours) before proceeding.",
            "After the rest period, heat a large pan over medium heat. Roll each dough piece into a rough circle, about 6-7 inches in diameter, keep work surface and rolling pin lightly floured. Don't stack uncooked tortillas on top of each other or they will stick together.",
            "When the pan is hot, place one dough circle into the pan and allow to cook for about 1 minute or until the bottom surface has a few pale brown spots and the uncooked surface is bubbly. If browning too fast, reduce the heat a bit. If it's taking longer than a minute to see a few pale golden brown spots on the underside of tortillas, increase the heat a bit. Flip to the other side and cook for 15-20 seconds. The tortillas should be nice and soft but have a few small brown spots on the surface.",
            "Remove from pan with tongs and stack in a covered container or zippered bag to keep the tortillas soft.",
            "Serve warm or allow to cool for later use. When ready to use, place a slightly damp paper towel in the bottom of a microwave-safe container (with a cover) that will hold the stacked tortillas. Microwave uncovered for 15-30 seconds (start with 15) or until warm, then keep covered to hold heat while serving.",
            "Store in an airtight container or zippered bag at room temperature for 24 hours or refrigerate for up to 1 week. To freeze, separate tortillas with parchment paper or waxed paper and place in a zippered bag before placing in the freezer.",
            "For chips, cut the cooked tortillas into smaller triangles, add a bit of olive oil and salt and whatever else you want, and bake them for a while in the oven at 350F."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "FUUL Bowl (Mo's adaptation - Recommended)",
        "Ingredients": [
            "Kale",
            "Couscous or quinoa or grain of choice",
            "A lemon plus 3 T lemon juice (would recommend using a fresh lemon for the kale marinade and garlic sauce and lemon juice for the tofu marinade)",
            "Extra firm tofu, drained and pressed",
            "1/4 cup soy sauce",
            "Veggies of your choice, I'd recommend 1 red bell pepper, 1 yellow onion, and 6-7 brussel's sprouts",
            "1/2 cup Vegan mayo or vegan garlic mayo",
            "2 garlic cloves",
            "Salt and pepper",
            "About 10 cherry tomatoes, cut in half",
            "A few pickled jalapenos, cut into pieces",
            "Sliced avocado (could also grill)",
            "Balsamic glaze",
            "Hot sauce of choice (optional)",
            "Pomegranate seeds",
            "Parsley for garnish (would recommend)",
            "Also could be good: Toasted pecans or walnuts, hemp hearts, avo-cilantro dressing, chopped cucumber"
        ],
        "Directions": [
            "Start your tofu marinating. Combine soy sauce and lemon juice (doesn't really matter the amount/ratio) in a pan or bag. Slice your tofu how you want, I'd recommend thin and wide slabs. Place in the marinade. Preheat the oven to 400F",
            "Chop your veggies to saute (red pepper, brussel's sprouts, onion). Place them in a pan on medium heat.",
            "If you're making a grain like quinoa, start that. If you're using couscous, you can wait because it doesn't take long at all.",
            "Make your lemon garlic aioli by combining the mayo, 2 cloves garlic (skip if using garlic mayo), 2 T fresh squeezed lemon juice, 1/4 t salt and 1/4 t pepper. Let sit so the garlic infuses the mayo",
            "De-stem your kale and place it in a bowl with the rest of the fresh squeezed lemon juice. You could also add a tiny bit of balsamic vinegar if you want. Massage it with your hands for a couple minutes.",
            "Start your couscous if that's the grain you choose. Don't forget to keep stirring the sauteing veggies.",
            "Place your marinated tofu on a silpat mat or parchment paper in the oven for 10 minutes. If you have a panini press or grill, take it out after 10 minutes and grill it for 5-10 minutes. If you're using a panini press, you may need to stack the tofu so that it's tall enough to press against both sides. If you don't have a press or grill, bake it for another 5-10 minutes to your liking.",
            "Chop your tomatoes, jalapenos, avocado, and any other veggies you're using for the top. Seed your pomegranate. Pull some stems off your parsley.",
            "Place the grain into the bowl with the massaged kale. Follow with the sauteed veggies on one side and tofu on the other. Place the fresh veggies and avocado on top, drizzle with garlic aioli (I'd use a lot) and balsamic glaze. Place the pomegranate seeds and any other topping you're using and garnish with parsley around the edges. If you're only one person, you'll have left overs, so leave half the ingredients out and store them in separate containers to make later."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Zuch Pasta",
        "Ingredients": [
            "1 Large Zucchini or Summer Squash",
            "6 ish cloves garlic",
            "Olive oil",
            "Pasta Sauce",
            "Coconut cream, or canned coconut milk & use the top layer",
            "Half a red bell pepper",
            "Handful of sun dried tomatoes"
        ],
        "Directions": [
            "Mince Garlic and add it to a pan with the olive oil, Saute until starts to brown",
            "Add half bell pepper diced and the handful of sun dried tomatoes roughly chopped",
            "Give it a minute then add the zucchini-quartered then cubed (?)",
            "Cook until zucchini is almost done then turn the heat up and brown the edges",
            "Then add in pasta sauce, however saucy you want it, and add the coconut cream-enough to make the sauce an orangish color",
            "Cook down if it's too liquidy for your liking and then mix in pasta of choice :)"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "The Office Wrap",
        "Ingredients": [
            "Kale",
            "Tortilla wraps",
            "Extra firm tofu",
            "Soy sauce",
            "Pepper",
            "Salt",
            "Lemon juice",
            "Optional: balsamic vinegar",
            "Onion, sliced into half rings",
            "Olive oil",
            "Hummus",
            "Lemon garlic aioli or a similar aioli (check Toppings, Sauces, Sides section)"
        ],
        "Directions": [
            "Caramelize the onions by sauteing them on low heat for 30 minutes. Optional: add in salt and some balsamic vinegar near the end",
            "Preheat oven to 450F",
            "Create a marinade by combining some soy sauce, lemon juice, and pepper",
            "Drain and slice the tofu into whatever size/shape you want for your wrap. I'd recommend flat rectangles",
            "Put them in the marinade for at least 15 minutes (the longer the better)",
            "Bake them in the oven for 15-25 minutes, depending on preference",
            "Massage kale for 2-3 minutes with the aioli",
            "Spread hummus on the wrap, then the onions, tofu, and kale",
            "Grill in a grill or on a pan",
            "Cut in half to eat"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Samosa Muffins",
        "Ingredients": [
            "3 cups mashed potatoes, (about 6 medium boiled)",
            "2 tablespoons coconut oil",
            "1/2 medium onion, minced",
            "2 garlic cloves, minced",
            "1 teaspoon ginger, grated",
            "1 teaspoon curry powder",
            "1/2 teaspoon salt",
            "1/4 teaspoon Cayenne pepper, optional",
            "2 tablespoons cilantro, finely chopped",
            "1 cup green peas"
        ],
        "Directions": [
            "Heat oil in a large skillet on medium-high heat. Add onion and cook until soft about 4 minutes, stir in garlic and ginger and cook for 2 minutes.",
            "Stir in curry powder, sea salt, cayenne pepper, cilantro and cook for 2 more minutes stirring constantly",
            "Add peas and stir to coat. Remove skillet from heat and stir in mashed potato and mix well.",
            "Spoon potato mixture evenly in muffin pan and bake for 30 minutes or until golden brown.",
            "Allow to slightly cool for at least 10 minutes (very important step) to make sure muffins don't fall apart. Remove from pan and enjoy!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Kate's Mac n Cheese",
        "Ingredients": [
            "Butter (like a big spoonful)",
            "Flour (less than the butter)",
            "A lot of non-dairy milk",
            "Garlic Powder",
            "Onion Powder (optional)",
            "Paprika (optional)",
            "Sour cream (optional)",
            "Mustard (I use yellow, you can try whatever) (just keep adding it until you like how it tastes)",
            "Non dairy cheese shreds of choice (optional but highly recommended)",
            "Nooch",
            "Salt and pepper (start slow)",
            "Optional add-ins: Chili Powder, Chipotle Powder, Liquid Smoke, Sriracha, Turmeric, Lemon Juice, Vinegar of some sort (I usually don't include an acid at all)",
            "*Note that if you leave out everything that is optional, you'll probably want to replace them with something else. Like garlic powder could probably be replaced with actual garlic or garlic salt."
        ],
        "Directions": [
            "Melt butter in a pot, add flour to make a roux",
            "Slowly add small amounts of milk as you go",
            "Add all spices you want, mustard, cheese, nooch, etc and mix thoroughly while heating.",
            "Stir until combined",
            "& then add pasta i guess Mo didnt make this part of the recipe lololol.",
            "Probs cook your pasta at the beginning.",
            "Taste and adjust spices if needed"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mo's Thai Curry",
        "Ingredients": [
            "Red onion (optional; I used one half)",
            "Bell pepper (optional; I used one half)",
            "Tofu (firm, extra firm, silken, try whatever you want to. I did extra firm and I used 1/2 a block)",
            "Broccoli (optional; I used one half)",
            "Mushrooms (optional; I used 3 cremini)",
            "Garlic cloves (I used 2)",
            "Ginger root (I used about 1 inch)",
            "Cilantro (I used 1/3 a bunch)",
            "Whatever other veggies you want",
            "1 can coconut milk",
            "Veggie broth or water (I used 2.5 cups)",
            "Soy sauce or tamari sauce (I used about 1 Tbsp)",
            "Lime juice (I used half a lime)",
            "Pinch of ground cayenne pepper or red pepper flakes (could also try sriracha)",
            "Yellow Thai curry paste or red Thai curry paste (I used yellow because it's what I had but then I added cumin as well. I used just under 1 Tbsp)",
            "Probably could add some form of sugar (brown sugar, a liquid sugar) but I didn't",
            "I also think crushed peanuts could be nice"
        ],
        "Directions": [
            "Freeze the tofu the day before, and then take it out of the freezer 12 hours before you're going to use it",
            "Cut up the tofu (I did large triangles) and bake it at 350F for about 10 minutes",
            "In the meantime, saute all the veg a bit (not the cilantro)",
            "Add the veg (except for the cilantro) to a pot with the coconut milk, curry paste, and broth/water",
            "Bring to a boil and then let simmer for a bit (10 min?)",
            "Add the tofu, tamari/soy sauce, lime juice, and cilantro (and peanuts if you want to try)",
            "Taste it and see if you can figure out what it's missing and let me know!!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Jackfruit Curry (Recommended)",
        "Ingredients": [
            "1 cup coconut milk",
            "1/2 cup vegetable broth (add 1/2 cup more at the end depending on preference)",
            "2 cans 20 oz. jackfruit in brine rinsed or water",
            "1/2 red bell pepper & 1/2 green bell pepper chunked, or whatever veg you have",
            "1/2 white onion diced 1 tbsp minced garlic",
            "3 tsp garam masala",
            "1 pinch cayenne pepper optional",
            "1/4 tsp ground ginger",
            "1 tbsp curry powder ( I did 2 t madras & 1 t jamacian)",
            "1 tsp sugar (optional- I think it's fine without)",
            "1/2 tsp salt",
            "*Jackfruit- drain brine/water and quick rinse. Then you can either squish each little triangle with your hand to ring out the extra liquid, or you can smash in between a towel. I use my hands cause I hate laundry. Then go through and cut off any hard pieces and any seeds that may have snuck into the can. Honestly, I also do this part by hand because I combine it with the next step which is to pull apart the jackfruit with a fork till it's broken up sufficiently. I just rip off the hard parts & separate the pieces."
        ],
        "Directions": [
            "1. In a large pan, saute onions and garlic until fragrant over medium heat with oil of your choice.",
            "2. Add in coconut milk, vegetable broth, and seasonings. Bring to a boil, then let simmer for 10 minutes, stirring frequently.",
            "3. Add the jackfruit and let it simmer for 5-10 minutes, the longer you leave it the more the jackfruit absorbs the flavor.",
            "4. Add in red and green bell peppers and stir to combine. Let set for a little if you prefer your bell pepper mushy."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Kerry's Potato Salad",
        "Ingredients": [
            "Potatoes of your choosing, and any amount",
            "Radishes (milder ones, not ones that are that spicy)",
            "Green onions or chives",
            "Salt",
            "Pepper",
            "Mayo",
            "Some kind of mustard, not that much",
            "Lots of options for other veggies and dressings, lmk what you come up with"
        ],
        "Directions": [
            "Boil the potatoes until really soft, then mash them up. Mash them less if you want chunkier salad",
            "Chop the veggies into whatever size you want. I do them pretty small.",
            "Add everything together. If you're not sure how much mayo and mustard to add, start with a bit and add more as you want. I'd start with just mayo and then taste it and decide if/how much mustard you want to add."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Vegan Butter Chicken",
        "Ingredients": [
            "For the tofu (or replace with cauliflower):",
            "2 (16 oz) blocks extra-firm tofu",
            "2 tablespoons olive oil (I used way less)",
            "2 tablespoons cornstarch",
            "1/2 teaspoon salt",
            "For the sauce:",
            "2 tablespoons vegan butter (or olive oil)",
            "1 large onion, diced small",
            "1 tablespoon grated fresh ginger (or 1 tsp dried)",
            "2 cloves garlic, minced",
            "1 tablespoon garam masala",
            "1 teaspoon curry powder",
            "1 teaspoon ground coriander",
            "1/4 teaspoon cayenne pepper",
            "1 teaspoon salt",
            "3 ounces tomato paste",
            "1 (13.5 oz) canned full fat coconut milk",
            "For serving:",
            "4 cups cooked white or brown rice",
            "chopped cilantro",
            "Naan (look up recipe if you want)"
        ],
        "Directions": [
            "1. Press the tofu: Wrap the block of tofu in paper towels. Place a plate or pan on top of the wrapped tofu, and put a couple of heavy books on top of that. Let the tofu press for 20 minutes. (You can skip this step if you get the super firm variety)",
            "2. Preheat the oven to 400 degrees F and line a baking sheet with parchment paper.",
            "3. Slice the tofu into about 6 slices (see photos in post above for reference). Now, rip each slice into medium-large pieces. You can also simply cut them into cubes, if you prefer, but ripping gives the tofu a great texture for this dish.",
            "4. Add the tofu pieces to a large ziplock bag, along with the olive oil, cornstarch and salt. Close the bag, and shake gently to coat. Arrange the tofu evenly on the prepared pan, and bake for 25-30 minutes, until golden and crispy (I cooked it for like 40 minutes).",
            "5. While the tofu bakes, prepare the sauce: Melt the 2 tablespoons of vegan butter in a large pan over medium-high heat. Saute the onion for 3-4 minutes in the butter, then add the ginger and garlic and cook for 1 more minute. Add the spices, salt, tomato paste and coconut milk. Stir until smooth and combined, then simmer for 5-10 minutes, stirring frequently.",
            "6. When the tofu is done baking, add it to the sauce and stir to coat the pieces. Serve over rice with naan. Garnish with chopped fresh cilantro. Enjoy!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Scott's Sweet Potato Burgers (Recommended) - Makes 6 big boys",
        "Ingredients": [
            "(Note: I would recommend doubling if you want leftovers)",
            "1 can/240 g chickpeas, drained and mashed (this is about 8.5 oz I think) (1/2 cup dried)",
            "1 can/240 g mixed beans, drained and mashed (1/2 cup dried)",
            "Handful of chopped coriander or parsley",
            "Flesh of a sweet potato, roasted (1 big or 2 small)",
            "3 T Piri Piri sauce (or some other spicy sauce)",
            "2 T tomato puree",
            "1 T oregano",
            "1 t dried chilli flakes",
            "Zest and juice of half a lemon",
            "5 T flour (I often double if the batter is still wet)",
            "2 t salt"
        ],
        "Directions": [
            "Combine everything and form patties. Then bake them or just skip straight to frying them. If you're going to freeze them or put them in the fridge for another day, I'd recommend baking them and then frying them right before you eat them. If you're going to eat them right away, you can just fry them without baking them first."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Barley Salad",
        "Ingredients": [
            "1 cup uncooked barley (or quinoa, bulgar, or grain of choice)",
            "1 cup shredded red cabbage (or green if that's what you've got)",
            "1/2 cup diced red bell pepper",
            "1/2 red onion, diced or minced",
            "1 cup shredded carrots (or chopped if you can't be bothered)",
            "cup chopped cilantro",
            "1/4 cup green onions, chopped",
            "1/2 cup cashews or peanuts",
            "Dressing:",
            "1/4 cup peanut butter",
            "1 tsp fresh minced ginger (I like to use a zester for mine)",
            "3 T soy sauce",
            "1 T sweetener such as maple syrup",
            "1 T red wine vinegar (rice wine works too!)",
            "1 tsp sesame oil (pretty important not to skip this one)",
            "1 tsp olive oil"
        ],
        "Directions": [
            "Cook your grain and cool.",
            "Put all dressing ingredients into the cup of a high speed blender or small food processor (gets lost in a big blender). Alternatively, mix all ingredients by hand very well. I often double the dressing (except the PB, which I use less of).",
            "Mix dressing and grain. Gets better when stored in fridge, but may need a bit more dressing when serving.",
            "Any crunchy veg will work here, be creative and clean out your produce drawer."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Black Bean and Butternut Squash Burritos",
        "Ingredients": [
            "1 medium butternut squash, peeled, cubed, & roasted",
            "1/2 cup uncooked short grain brown rice (yields: 1.5 cups cooked)",
            "1-2 tsp olive oil",
            "1 cup chopped sweet onion",
            "2 garlic cloves, minced",
            "1 red pepper, chopped",
            "1 tsp kosher salt, or to taste",
            "2 tsp ground cumin, or to taste",
            "1/4 tsp cayenne pepper, or to taste",
            "One 15-oz can black beans (about 1.5-2 cups cooked), drained and rinsed",
            "3/4 cup Daiya cheese",
            "4 tortilla wraps (large or x-large)",
            "Toppings",
            "avocado",
            "salsa",
            "vegan sour cream",
            "spinach/lettuce",
            "cilantro"
        ],
        "Directions": [
            "Cook brown rice (for directions, see here)",
            "In a large skillet over medium-low heat, add oil, onion, and minced garlic. Sautee for about 5 minutes, stirring frequently. Now add in salt and seasonings and stir well.",
            "When butternut squash is tender remove from oven and cool slightly. Add 1.5 cups of the cooked butternut squash to the skillet and stir well. You can mash the squash with a fork if some pieces are too large. Add Daiya cheese and heat another couple minutes.",
            "Add bean filling to tortilla along with desired toppings. Wrap and serve. Leftover filling can be reheated the next day for lunch in a wrap or as a salad topper"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Black Bean Salad with Corn, Red Peppers and Avocado in a Lime-Cilantro Vinaigrette",
        "Ingredients": [
            "2 15-ounce cans black beans, rinsed and drained",
            "3 ears fresh cooked corn, kernels cut off the cob",
            "2 red bell peppers, diced",
            "2 cloves garlic, minced",
            "2 tablespoons minced shallots, from one medium shallot",
            "2 teaspoons salt",
            "1/4 teaspoon cayenne pepper",
            "2 tablespoons sugar",
            "9 tablespoons extra virgin olive oil, best quality such as Colavita",
            "1 teaspoon lime zest (be sure to zest limes before juicing them)",
            "6 tablespoons fresh lime juice",
            "1/2 cup chopped fresh cilantro, plus more for garnish",
            "2 avocados, chopped"
        ],
        "Directions": [
            "Combine all ingredients except for avocados in a large bowl and mix well. Cover and chill for a few hours or overnight. Right before serving, add avocados and mix gently, being careful not to mash avocados. Garnish with a more chopped cilantro if desired. Serve at room temperature."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mo's Split Pea Soup",
        "Ingredients": [],
        "Directions": [
            "4 cups of water for 1 cup of split peas",
            "Saute onion and garlic in the soup pot.",
            "Add split peas, barley, carrots, spices, and water.",
            "Bring to boil, then reduce to simmer.",
            "Keep mostly covered.",
            "Add water if necessary.",
            "Spices:",
            "Salt",
            "Pepper",
            "Paprika or smoked paprika",
            "Cayenne if spicy",
            "Bay leaf if you're feeling fancy"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Norman's Burgers",
        "Ingredients": [
            "Eggplant",
            "Mushrooms",
            "Garlic",
            "Onions",
            "Chickpeas",
            "Bread crumbs",
            "Oil",
            "Peperoncino (I think like cayenne? Idk we made it up while we were in Italy)",
            "Paprika",
            "Oregano",
            "Sage",
            "Cumin",
            "Salt and pepper"
        ],
        "Directions": [
            "Blend chickpeas with oil and combine with veggie mush.",
            "Add peperoncino, paprika, oregano, sage, cumin, salt, and pepper",
            "Add flour and bread crumbs to mix and also coat patties in it.",
            "Bake in oven 10 minutes, then flip, bake for additional 15 minutes",
            "Fry with vegetable oil or save to fry when you want to eat them."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Quinoa Stuffed Sweet Potatoes",
        "Ingredients": [
            "1 tablespoon olive oil",
            "2 cloves garlic",
            "1 small green chili, deseeded and minced (for optional heat)",
            "3/4 cup quinoa, rinsed and drained",
            "1 400mL can coconut milk (1/4 cup reserved)",
            "1 + 1/2 teaspoons curry powder",
            "1/2 teaspoon sea salt",
            "Pepper to taste",
            "1 cup cooked chickpeas",
            "3 small sweet potatoes",
            "Olive oil",
            "Sea salt",
            "Optional for top:",
            "1 ripe avocado",
            "1 lime",
            "1 small bunch fresh cilantro",
            "1 green onion, slice"
        ],
        "Directions": [
            "Rinse and dry the sweet potatoes, then slice in half lengthwise. Place cut side down on a baking sheet lined with parchment and drizzle with olive oil and sprinkle with a generous amount of salt. Bake for 15 minutes, then flip and return to bake for another 10-15 minutes, or until the insides are soft and the flesh is pulling away from the skin. May take longer if you have larger sweet potatoes.",
            "While the potatoes are baking, prep the filling.",
            "Heat olive oil in a medium sauce pot then add the garlic, chili. Sautee for one minute then add the quinoa. Toast the quinoa for a minute or two, add the curry powder and stir to coat. Add 1 + 1/4 cups of coconut milk, 1/4 cup of water and salt. Bring to a boil, then reduce to a simmer covered for 15 minutes. Stir in the chickpeas and remove from heat. Set aside.",
            "Once the potatoes are done remove from the oven and set aside until cool enough to handle",
            "Gently scoop out the soft  flesh of the sweet potatoes, trying to keep the skin intact. It's ok if you don't get it all out.",
            "Add the potato flesh to the quinoa mixture and stir well to combined.",
            "Spoon the quinoa mixture back into the empty potato skins until well stuffed and place back in the oven at 400 F for 10 minutes. You may have some filling left over, so you can choose to pile it high or serve on the side.",
            "In a small blender, blend together half the avocado, 1/4 cup coconut milk, 1/2 cup cilantro, 1 tablespoon lime juice, 1/2 teaspoon lime zest and a good pinch of salt. Season to taste.",
            "Serve potatoes with avocado cilantro sauce, fresh cilantro, sliced green onions and lime wedges. Add your favorite hot sauce and extra avocado on the side."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chickpea Mash (good, easy to simplify, easy to make, easy to eat)",
        "Ingredients": [
            "2 cups cooked garbanzo beans aka chickpeas, 430g",
            "1/4 cup red onion 35g, diced",
            "1/4 cup grated carrot 30g",
            "1/2 cup celery 50g, chopped",
            "2 teaspoons yellow mustard 15g",
            "1 tablespoon lemon juice 15ml",
            "5 turns fresh black pepper",
            "1/2 teaspoon sea salt",
            "Optional: mayo, dijon mustard, fresh dill, relish"
        ],
        "Directions": [
            "Place the garbanzo beans in a medium-sized bowl and mash them with a fork. You don't have to mash them completely. If some garbanzo beans are left whole, it's totally fine.",
            "Add the red onion, carrot, celery, yellow mustard, lemon juice, black pepper and sea salt.",
            "Stir until all of the ingredients are combined.",
            "Serve on toasted sprouted grain bread or on cucumber rounds as a snack or appetizer. You can also put it in a sprouted grain tortilla or blanched collard leaf with some mixed greens and avocado to make a wrap."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Pasta Salad",
        "Ingredients": [
            "8 ounces elbow macaroni (use whole grain or gluten-free if you'd like)",
            "3/4 cup vegan mayonnaise",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon Dijon mustard",
            "1 celery stalk, minced",
            "1/4 medium red bell pepper, cut into 1/4-inch dice",
            "2 tablespoons minced red onion",
            "2 tablespoons minced parsley",
            "2 tablespoons sweet pickle relish",
            "Salt and freshly ground pepper to taste"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Creamy Garlic Pasta with Roasted Tomatoes",
        "Ingredients": [
            "3 cups cherry tomatoes (halved)",
            "10 ounces pasta",
            "Olive oil",
            "2 medium shallots or some onion, diced",
            "8 large cloves garlic minced",
            "1 pinch each sea salt and black pepper",
            "3-4 Tbsp unbleached all-purpose flour",
            "2 1/2 cups unsweetened plain nut milk (sub up to 1 cup with veggie stock, if preferred)"
        ],
        "Directions": [
            "Preheat oven to 400 degrees F (204 C) and toss tomatoes in a bit of olive oil and sea salt. Place cut side up on a parchment-lined baking sheet and bake for 20 minutes while you prepare the rest of the dish. Then set aside.",
            "Bring a large pot of water to a boil and cook pasta according to package instructions. When done, drain, cover and set aside.",
            "In the meantime, prepare the sauce. In a large skillet over medium-low heat, add 1 Tbsp olive oil and the garlic and shallot. Add a pinch of salt and black pepper and stir frequently, cooking for 3-4 minutes until softened and fragrant.",
            "Stir in flour and mix with a whisk. Once combined, slowly whisk in the nut milk a little at a time so clumps don't form. Add another healthy pinch of salt and black pepper, bring to a simmer and continue cooking for another 4-5 minutes to thicken. Taste and adjust seasonings as needed. (Optional: You can also add a few shakes of vegan parmesan for extra flavor at this time if you wish.)",
            "If you want an ultra creamy sauce, transfer sauce to a blender (or use an immersion blender) to blend the sauce until creamy and smooth. Place back in pan and reduce heat to a low simmer until desired thickness is reached.",
            "Once the sauce is to your desired thickness, taste and adjust seasonings as needed. Then add pasta and roasted tomatoes and stir.",
            "Serve immediately and garnish with extra black pepper, fresh basil, and/or vegan parmesan cheese. Best when fresh, but will keep for up to 2 days in fridge."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Pumpkin-Seed/Cashew Alfredo Pasta (Recommended)",
        "Ingredients": [
            "One box pasta",
            "For the alfredo:",
            "1 tsp oil",
            "1/2 cup chopped onion or shallots",
            "3 fat cloves of garlic",
            "1/4 cup raw pumpkin seeds or cashews",
            "1/2 cup water divided",
            "3 tbsp nutritional yeast",
            "1/4 tsp or more dried thyme",
            "1/4 tsp dried basil or oregano",
            "3/4 tsp or more salt",
            "1.5 to 2 tsp fresh lemon juice",
            "1/2 tsp white vinegar",
            "1 tbsp flour",
            "Some pepper",
            "2 tsp extra virgin olive oil",
            "1 cup unsweetened non dairy milk",
            "Add peas or spinach or broccoli or other veggies"
        ],
        "Directions": [
            "Cook pasta according to instructions and keep aside.",
            "Heat oil in a skillet over medium heat. Add onions and garlic and cook until translucent. 3 to 4 minutes.",
            "Add pumpkin seeds or cashews and 1/4 cup water and bring to a boil. about 4 minutes. Cook for 2 more minutes, then let it cool a bit.",
            "Meanwhile add all the ingredients from nutritional yeast through non dairy milk to the blender (nutritional yeast, herbs, salt, lemon, vinegar, flour, pepper, olive oil, non dairy milk). Add the onion pumpkin seed mixture to the blender. Blend until smooth.",
            "Return to the skillet over medium heat. Add another 1/4 cup water. Bring to a boil. Stir frequently to avoid lumps. The mixture will thicken considerably. Cook for another minute, so the flour is cooked through. Total 3 to 4 minutes. Carefully taste and adjust the salt and tang. Add more herbs if you wish."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cranberry Walnut Chickpea Salad Sandwich",
        "Ingredients": [
            "3 cups cooked or 2 cans (15 oz) garbanzo beans (chickpeas), drained and rinsed",
            "1 cup celery, diced",
            "1/2 cup organic dried cranberries (chopped fresh would be great too)",
            "1/2 cup walnuts or pecans, roughly chopped",
            "1/2 cup scallions (green onions), thinly sliced, white & green parts",
            "mineral salt & freshly ground pepper, to taste (I used about 1/2 teaspoon each)",
            "Dressing",
            "6 tablespoons (1/3 cup) tahini or vegan mayo",
            "4 tablespoons (1/4 cup) champagne, white wine or cider vinegar (I used Orange Muscat Champagne Vinegar)",
            "2 tablespoons water (only needed if using tahini)",
            "2 teaspoons pure maple syrup"
        ],
        "Directions": [
            "Start by mixing your dressing. In a small bowl combine tahini/mayo, vinegar, water and maple syrup. Set aside so the flavors come together. This can be made a day or two ahead and stored in the refrigerator until ready to use. Add a tad more water, or vinegar if you're a vinegar lover, to thin out dressing as desired. If using vegan mayo, you may like to add 2 more tablespoons.",
            "In a medium to large bowl, add your garbanzo beans and roughly mash with a strong fork or potato masher. Add in celery, cranberries, nuts, scallions, salt, pepper and dressing, mix well. Serve at room temp or let chill in the refrigerator for an hour before serving.",
            "Serve on your favorite bread as a closed or open faced sandwich, or on a bed of leafy greens. You may even opt to simply enjoy the salad as is."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Sarah's Bomb Ass Ravioli",
        "Ingredients": [
            "Dough",
            "4 cups unbleached all-purpose flour",
            "1.25 cups water",
            "1 TBS oil",
            "1 tsp salt"
        ],
        "Directions": [
            "You can use a bowl and finish by hand on the counter, you can use a dough hook with a mixer, or you can use a bread machine to mix. I chose the bowl and hand method.",
            "Sift flour into a large bowl.",
            "Make a well and add the water, oil, and salt.",
            "Begin to mix by slowly adding the flour into the water around the well.",
            "Once mixing becomes too hard to do in the bowl, dump the mixture onto a floured surface and knead until combined.",
            "I like to knead it for a few minutes, lay a towel over it to let it rest, then return and repeat a few times until I have a nice smooth dough.",
            "Wrap it in plastic wrap and let it rest on the counter for a minimum of 20-30 minutes.",
            "While the dough is resting make the filling"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "10 Minute Mac-n-Cheese",
        "Ingredients": [
            "8 oz. favorite pasta",
            "1 1/4 cups unsweetened almond milk (at room temperature)",
            "2 tablespoons olive oil",
            "2 heaping tablespoons flour",
            "1/4 - 1/2 cup nutritional yeast flakes",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon chili powder",
            "1/4 teaspoon chipotle powder",
            "mineral salt, to taste"
        ],
        "Directions": [
            "Cook your pasta according to package. Drain and place back in pot, set aside.",
            "In a small/medium saucepan, heat oil over medium heat, add flour and whisk to incorporate. Continue whisking and cook for 2 minutes. Add milk slowly, whisking constantly. Turn heat to low and cook until sauce thickens, about 8 minutes, stirring frequently. Remove from heat. Stir in nutritional yeast, salt, garlic powder, chili powder and chipotle powder. Stir until everything is incorporated and smooth again. Taste for flavor.",
            "Add sauce to the pasta, toss well, add more milk as needed and serve right away."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Shepherd's Pie",
        "Ingredients": [
            "1 tablespoon vegetable oil",
            "2 tablespoons garlic, minced",
            "1 onion, diced",
            "3 stalks of celery, chopped",
            "2 carrots, sliced",
            "2 cups mushrooms, sliced",
            "1 cup corn",
            "1/4 cup parsley, chopped",
            "1 tablespoon tomato paste",
            "1 teaspoon thyme",
            "1 teaspoon sage",
            "1 teaspoon pepper",
            "1 teaspoon salt",
            "2 cups veggie broth",
            "1 tablespoon flour",
            "For the potato topping",
            "4 potatoes, peeled and chopped",
            "1 tablespoon vegan butter",
            "1/2 cup soy/nut milk",
            "1 teaspoon salt",
            "1 teaspoon pepper"
        ],
        "Directions": [
            "For the filling:",
            "In a medium-large pot, over medium heat, combine oil, garlic, and onions. Cook for one minute, until onions start to soften.",
            "Add celery and carrots, stir until onions are translucent.",
            "Add mushrooms, corn, parsley, tomato paste, thyme, sage, salt, and pepper until well mixed.",
            "Add veggie stock in half-cup increments, allowing it to come to a simmer before adding more. Add flour, then mix. Continue mixing until the mixture thickens. Once thick, remove from heat and pour into a pie dish.",
            "For the potatoes:",
            "Add potatoes to a large pot and cover with lightly salted water. Set over medium-high heat and bring to a boil. Cook until potatoes have softened and are fork-tender. Remove from heat and drain.",
            "Mash potatoes then add butter, milk, salt, and pepper.",
            "Spoon potato mixture over the top of the veggies in the pie dish, and smooth so that it is evenly spread.",
            "Optional: using a butter knife or a long, thin spatula. press into potato surface every inch to create a beautiful, undulating presentation.",
            "Bake pie for 20-25 minutes.",
            "Allow to cool for five minutes."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Dumplings with Peanut Sauce",
        "Ingredients": [
            "1 package Teriyaki style baked tofu",
            "1 small head cauliflower",
            "1 cup green onion, chopped",
            "2 cups bok choy leaves",
            "3 cloves garlic, minced",
            "11/2 cups fresh shiitake mushrooms",
            "1 tablespoon sesame oil",
            "2 tablespoons soy sauce or tamari",
            "2 teaspoon minced ginger",
            "2 teaspoon miso paste, white or yellow",
            "eggless dumpling wrappers",
            "water for sealing dumplings",
            "Easy Peanut Sauce",
            "4 tablespoons peanut butter",
            "4 tablespoons soy sauce",
            "2 tablespoons rice vinegar",
            "2 tablespoons maple syrup",
            "2 teaspoons minced ginger"
        ],
        "Directions": [
            "Remove from heat and let cool for 5 minutes. While the veggies are cooling, combine all ingredients for the Easy Peanut Sauce in a bowl and whisk together until smooth.",
            "Transfer the veggie mixture from the skillet into a large food processor bowl. Pulse for 2-3 minutes for 10 seconds at a time until you reach the desired consistency. You want it to be mostly smooth but not a homogenous paste. (so still a tad chunky)",
            "Place an eggless dumpling wrapper on a lightly floured surface. Spoon one heaping teaspoon into the center of the wrapper and carefully moisten the outer rim of the wrapper. Fold the Vegan Dumpling in half and press the edges together to seal them, making sure to remove all air from the center. Pinch the sealed edges in a visually pleasing fashion (or leave them flat) and cook them in a lightly oiled pan over medium heat for about 2 minutes on each side. Watch them as they tend to brown quickly."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Falafel Onion Rings",
        "Ingredients": [
            "2-3 large white onions",
            "Falafel:",
            "2 cans chickpeas (drained)",
            "1 red onion (minced)",
            "1/2 lemon (juiced)",
            "3 cloves garlic (minced)",
            "1.5 tbsp harissa paste",
            "decent pinch of salt",
            "1 tsp cumin",
            "good pinch pepper",
            "4 tbsp plain flour",
            "small bunch cilantro",
            "small bunch parsley",
            "Batter:",
            "1/2 cup plain flour",
            "1 cup soy milk",
            "Panko breadcrumbs",
            "Vegetable oil (for frying)",
            "To Serve:",
            "Hummus (your favourite flavour)"
        ],
        "Directions": [
            "Cut the white onions into 1cm thick slices & carefully push out the rings individual rings",
            "Lay the rings out on a well oiled baking tray",
            "Put all the falafel ingredients in a food processor & whizz them up into a paste",
            "Tightly stuff each onion ring with falafel paste & then put them in the freezer until they're frozen solid (we froze ours overnight)",
            "Put the plain flour & soy milk into a mixing bowl & mix it together until there's no lumps",
            "Take the rings out of the the freezer",
            "Dip the batter-covered rings in panko breadcrumbs (make sure they're well covered - that's how you get a nice crispy crust)",
            "Put the onion rings in very hot oil & fry them until they're golden brown & crispy",
            "Put the onion rings on some kitchen paper to soak up any excess oil"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Taco Cups (works well)",
        "Ingredients": [
            "Tortillas",
            "Beans (refried is best)",
            "Vegan beef crumbles",
            "Taco seasoning (or just cumin)",
            "Cilantro",
            "Avocado",
            "Daiya shredded cheese",
            "Vegan sour cream (Tofutti brand is good)",
            "Rice"
        ],
        "Directions": [
            "Cook the taco ingredients like you normally would",
            "Cut the tortillas into quarters and put them into a muffin tin. Alternatively you can cut them into wide strips and put two strips criss-cross in each muffin tin spot",
            "Load the taco ingredients into each one and then fold the top over",
            "Bake in the oven until brown",
            "Top with yummy stuff and salsa"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Falafel Waffles with Truffle Dill Mayo",
        "Ingredients": [
            "1 15-ounce can chickpeas",
            "3/4 cup chickpea liquid (aquafaba), reserved from can",
            "4 tablespoons rice flour",
            "11/2 cup Just Mayo Truffle, divided",
            "6 tablespoons tahini, divided",
            "1 tablespoon dried dill",
            "pinch cayenne (optional)",
            "3 cloves garlic, minced",
            "6 1/2 tablespoons lemon juice, divided",
            "1 teaspoon salt, divided",
            "1/4 teaspoon black pepper",
            "1/4 cup fresh dill, chopped",
            "3/4 teaspoon ground cumin",
            "1/4 teaspoon harissa (optional)",
            "Cooking Spray",
            "1/2 cup mini heirloom cherry tomatoes, quartered",
            "1/4 cup cucumber slices"
        ],
        "Directions": [
            "Set a strainer or colander over a large bowl.  Pour the can of chickpeas into the strainer and allow the liquid (aquafaba) to drain into the bowl.  Measure out 3/4 cup aquafaba from the bowl for the batter.",
            "To make the batter, pulse the aquafaba, rice flour, and 1/4 cup chickpeas in a blender or food processor until well mixed, 1-2 minutes.",
            "Add the remaining chickpeas, 1/2 cup Just Mayo Truffle, 4 tablespoons tahini, dried dill, pinch of cayenne, garlic, 5 tablespoons lemon juice, 1/2 teaspoon salt and 1/4 teaspoon black pepper. Puree to form a smooth, thick batter.",
            "To make Truffle Dill Mayo, whisk together the 1 cup Just Mayo Truffle, fresh dill, 2 tablespoons tahini, 11/2 tablespoons lemon juice, cumin, harissa, and salt. Cover and refrigerate until ready to serve.",
            "Heat waffle maker to medium high. When the waffle maker comes to temperature, lightly spray waffle maker with cooking spray. Ladle 1/2 cup batter into waffle iron and cook until crispy, about 5 minutes.",
            "Top each falafel waffles with 1-2 teaspoons of Truffle Dill Mayo, a handful of cherry tomatoes and cucumber slices.",
            "Serve immediately."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Falafel Hot Dogs",
        "Ingredients": [
            "3 cups chickpeas",
            "2 red onions",
            "1 bunch parsley",
            "1 T cumin",
            "1/2 T chilli powder",
            "1 T ground coriander",
            "2 cloves garlic",
            "1 cup flour",
            "4 T olive oil"
        ],
        "Directions": [
            "Blend ingredients",
            "Scoop out and shape into hot dog shape on cookie sheet with parchment paper",
            "Bake for 30 minutes at 400",
            "Pair with sauteed onion, hot dog bun, condiments, pickles, etc."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Twice Baked Potatoes",
        "Ingredients": [],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Carrot Fries (Recommended)",
        "Ingredients": [
            "2 carrots",
            "2 tablespoons olive oil",
            "1 tablespoon fresh parsley, chopped",
            "1 teaspoon paprika",
            "1 teaspoon salt",
            "1 teaspoon pepper",
            "Greek yogurt chive dip:",
            "1 cup plain vegan greek yogurt",
            "1 tablespoon lemon juice",
            "2 tablespoons chives",
            "1/4 teaspoon salt",
            "1/4 teaspoon pepper"
        ],
        "Directions": [
            "Cut carrots into fries and combine in a large bowl with olive oil, parsley, paprika, salt, and pepper.",
            "Place on baking sheet lined with parchment paper in a single layer. Bake for 20-25 minutes, flipping halfway.",
            "Prepare dip while fries are baking. Combine all dip ingredients in a small bowl and set aside in the refrigerator until ready to use."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Spicy Masala Veggie Burgers (they stick together!)",
        "Ingredients": [
            "2 red potatoes",
            "2 large carrots",
            "1/2 bell pepper",
            "1/2 cup corn",
            "1/2 cup edamame",
            "1/2 cup oats",
            "1/2 t ginger",
            "1/2 t turmeric",
            "1 t garam masala",
            "1/4 t mustard seed",
            "1/2 t cayenne pepper",
            "2 cloves garlic",
            "1 T olive oil",
            "1/2 t salt",
            "1 Tbsp oil"
        ],
        "Directions": [
            "In a food processor, grind the oats until they are a grainy powder. Add the veggies, and spices. Blend.",
            "Shape the mixture into patties, and fry, grill, bake, or freeze them for later!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Deviled Potato Bites",
        "Ingredients": [
            "small yellow potatoes",
            "chickpeas- 15 oz. can",
            "lemon juice- 1 Tbsp.",
            "garlic powder- 1 Tbsp.",
            "dijon mustard- 1 tsp",
            "turmeric- 1 tsp",
            "tahini- 2 Tbsp.",
            "water- 2 Tbsp. (add more as needed for a creamier texture)",
            "salt- to taste",
            "pepper-to taste"
        ],
        "Directions": [
            "In a food processor, combine all remaining ingredients and blend thoroughly. Add more water as needed until the mixture is smooth and creamy.",
            "Spoon mixture into a piping bag, and fill the potato cups.",
            "Sprinkle with paprika or seasoning salt and chives."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Broccoli Cheese Casserole",
        "Ingredients": [
            "1 large baking potato, about 1 lb., peeled and diced",
            "1/2 cup chopped carrots, 1 large or 2 small",
            "2 tbsp. olive oil",
            "1 large onion, diced",
            "2 garlic cloves, minced",
            "12 oz. button mushrooms, cleaned, stemmed and coarsely chopped",
            "2 cups vegetable broth",
            "1/2 cup short or medium grain brown rice",
            "1 large broccoli crown, broken into small florets (about 4 cups)",
            "1/2 cup nutritional yeast flakes",
            "1 tablespoon lemon juice, plus more to taste",
            "2-3 tsp. white miso paste, optional, but highly recommended",
            "about 2 cups unflavored soy or almond milk",
            "salt and pepper to taste"
        ],
        "Directions": [
            "Place potato and carrots into a medium saucepan and cover with water. Bring to a boil. Lower heat and allow to cook at a low boil until tender, about 15 to 20 minutes. Remove from heat and drain into a colander. Transfer to a food processor and blend until completely smooth, stopping to scrape down sides of bowl as needed.",
            "Add broth and rice to pot. Stir to incorporate. Raise heat and bring to a simmer. Cover and allow to simmer until rice is fully cooked, about 45 minutes. There should be some liquid remaining in the pot when rice is finished cooking.",
            "Uncover pot and stir in potato mixture, broccoli, nutritional yeast, lemon juice and miso, if using. Thin with about 2 cups of milk, using a bit less if mixture seems too thin, more if it seems too thick. Stir and bring to a low simmer. Cook just until broccoli is tender and bright green, about 3 minutes. Season with salt and pepper."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Lasagna",
        "Ingredients": [
            "Cashew bechamel sauce:",
            "1.5 cups cashews (soaked overnight)",
            "cup nutritional yeast",
            "2 tsp lemon juice",
            "1 tsp garlic powder",
            "1 tsp onion powder",
            "cup water (more if needed)",
            "dash salt and pepper",
            "Veggie tomato sauce:",
            "1 white onion, chopped",
            "3 garlic cloves, minced",
            "6-8 mushrooms, sliced",
            "2 zucchini, chopped",
            "1 red bell pepper, chopped",
            "2 cups of spinach",
            "2 carrots, peeled and chopped",
            "2 sticks celery, chopped",
            "1/4 cup basil, chopped",
            "1.5 jars of canned tomatoes",
            "1/2 cup tomato puree",
            "spices: oregano, basil, nutritional yeast, salt, pepper, paprika",
            "1/4 cup veggie broth",
            "Toppings:",
            "Almond parmesan cheeze"
        ],
        "Directions": [
            "Prepare and cut all the vegetables as instructed.",
            "In the meantime, prepare the cashew bechamel and almond parmesan cheeze (as instructed in recipe). For the cashew bechamel sauce, add all the ingredients into the blender and mix until smooth.",
            "Finish with a layer of tomato sauce and sprinkle the almond parmesan cheeze on top.",
            "Cook in the oven for about 30 minutes"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Spinach Artichoke Pepper Poppers",
        "Ingredients": [],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Potstickers",
        "Ingredients": [
            "1 cup carrot, roughly chopped",
            "2 cups napa cabbage, roughly chopped",
            "1/2 cup green onions, very thinly sliced",
            "1/4 cup Just Mayo Sriracha",
            "2 tablespoons plum sauce",
            "1 teaspoon black sesame seeds, toasted (plus additional for garnish)",
            "1/4 cup cilantro, minced",
            "1 teaspoon salt",
            "24 round wonton wrappers",
            "1 tablespoon vegetable oil",
            "1/4 cup water",
            "1 green onion, thinly sliced (for garnish)",
            "Dipping Sauce Ingredients:",
            "1/2 cup Just Mayo Sriracha",
            "1 tablespoon soy sauce or tamari",
            "1 tablespoon rice vinegar",
            "1/2 teaspoon toasted sesame oil"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Simple Potato Curry",
        "Ingredients": [
            "1 tablespoon coconut oil",
            "2-3 cloves garlic, minced",
            "1 medium onion, diced",
            "4 small potatoes or 2 medium/large potatoes",
            "1 13.66-ounce can full-fat coconut milk",
            "1 cup diced tomatoes",
            "1 cup frozen peas",
            "Some broccoli and other veggies of your choosing",
            "1/4 teaspoon red pepper",
            "1 teaspoon curry powder",
            "1 teaspoon turmeric",
            "1 teaspoon salt",
            "1 teaspoon grade B maple syrup",
            "1 tablespoon fresh minced ginger"
        ],
        "Directions": [
            "Add 1 tablespoon coconut oil to large skillet on medium heat. Add minced garlic.",
            "Once garlic is fragrant, add diced onion and cook until starting to turn translucent, about 5 minutes.",
            "Add coconut milk, diced tomatoes, and spices. Stir to combine.",
            "Bring to a low simmer and add potatoes.",
            "Cover and let simmer on low/medium until potatoes are softened, 10-15 minutes.",
            "Add frozen peas, stir, and let sit for 5 minutes.",
            "Stir again and serve. Store leftover in airtight container for up to 1 week."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Falafel Sandwich (Recommended)",
        "Ingredients": [
            "1 15-oz can chickpeas, ?drained and rinsed",
            "1/4 yellow onion, cut into 3 or 4 chunks",
            "1/4 cup whole-wheat pastry flour",
            "2 tbsp fresh flat-leaf parsley",
            "4 cloves garlic, divided (Leave 2 cloves whole and mince 2 cloves)",
            "1 tsp sodium-free baking powder",
            "1/2 tsp ground cumin",
            "1/2 tsp ground coriander",
            "1/2 tsp sea salt",
            "Olive oil cooking spray",
            "1/4 cup tahini paste",
            "2 tbsp fresh lemon juice",
            "1/4 tsp paprika",
            "6 6-inch whole-wheat pitas",
            "1 head green leaf or red leaf lettuce, ? coarsely shredded",
            "1 tomato, cut into thin wedges",
            "1/2 cucumber, peeled and sliced",
            "1 low-sodium dill pickle, sliced",
            "1/4 small red onion, thinly sliced",
            "Harissa or other hot sauce, optional"
        ],
        "Directions": [
            "To a food processor, add chickpeas, yellow onion, flour, parsley, whole garlic, baking powder, cumin, coriander and salt and pulse to a grainy paste, scraping down bowl as necessary.",
            "With lightly moistened hands, shape paste into 12 golf ball-size rounds, arranging on a cookie sheet. Cook falafel for like 15 minutes or until you can pick them up without them falling apart.",
            "Coat a very large nonstick skillet with cooking spray and heat on medium-low. Working in batches if necessary to avoid crowding the skillet, add balls and use a spatula to flatten to about 1/2 inch thick. Cook until browned on bottom, 4 to 5 minutes. Flip and brown other side, 4 to 5 minutes.",
            "Meanwhile, in a small bowl, whisk together tahini, 1/4 cup water, lemon juice, remaining minced garlic and paprika.",
            "Cut about 1 inch off top of each pita, forming a pocket. Add 2 falafel to each pita and divide lettuce, tomato, cucumber, pickle, red onion and tahini sauce among pitas. Drizzle each with harissa (if using)."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mo's Peanut Noodles",
        "Ingredients": [
            "Noodles",
            "Zucchini",
            "Broccoli",
            "Tofu",
            "Carrots",
            "Onion",
            "Garlic",
            "Also good: snap peas, hot peppers, bell peppers, green onion, ginger"
        ],
        "Directions": [
            "Combine peanut butter, soy sauce, and a little bit of brown sugar. Add to pasta mix.",
            "Put crushed peanuts and green onion on top if you're feeling fancy. You could also try adding sriracha though I've never done that."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Uncle Jose's Potato Tacos",
        "Ingredients": [
            "Make mashed potatoes (boil potatoes, mash them up, add butter and garlic and salt. If you don't have a potato masher or mixer make sure you boil them all the way or it's gunna be really hard to mash them up with a fork)",
            "Make (or buy) tortillas",
            "Put the mashed potatoes in the tortillas",
            "Put oil (not olive oil) on a pan and put the potato tacos in the oil",
            "Fry them until they're what you want",
            "Add hot sauce, chopped tomatoes, and lettuce"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mini Mediterranean Tarts (Good for when having people over, like for Shabbat. Simple to make)",
        "Ingredients": [
            "1 sheet of puff pastry",
            "2 tbsp tomato puree",
            "1 tbsp olive oil",
            "1 tbsp balsamic vinegar",
            "Pinch salt",
            "1 tsp black pepper",
            "Toppings:",
            "Courgette (zucchini)",
            "Cherry tomatoes",
            "Kalamata olives",
            "Capers",
            "Sundried tomatoes",
            "Red Onion",
            "Vegan cheese (optional)",
            "Basil (optional)",
            "Soy milk for brushing",
            "Method:",
            "1. Lay the sheet of puff pastry onto a baking tray and cut into six squares. Then score a border onto the inside of the squares.",
            "2. In a bowl, mix the tomato puree, oil, vinegar, salt and pepper to make a sauce. Then spread onto the inner of each square.",
            "3. Put a few of each topping onto each of the squares.",
            "4. Brush the puff pastry borders with soy milk",
            "5. Cook for 15-20 minutes at 180? (356?), or until they begin to look golden brown",
            "6. Serve, they're great hot or cold"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Crunch Wrap (like Taco Bell)",
        "Ingredients": [
            "10 oz meatless crumbles",
            "Taco seasoning",
            "3 T vegan butter",
            "1/4 cup nondairy milk",
            "1 cup jack-style vegan cheese",
            "1 cup cheddar style vegan cheese",
            "2 T nutritional yeast",
            "Soft (small) corn tortillas",
            "Bigger tortillas",
            "Vegan sour cream",
            "Lettuce",
            "Tomatoes"
        ],
        "Directions": [
            "Cook the meatless crumbles in a pan on the stove",
            "Mix together the butter, milk, cheeses, and nooch in a pot on the stove until melted and combined",
            "Fry the small tortillas",
            "Lay out the bigger tortilla and put the cheese and the meat on it, then place one of the smaller fried tortillas and put the sour cream, lettuce, chopped tomatoes, and more cheddar cheese on it.",
            "Fold it up into like a pentagon and fry it.",
            "Serve with hot sauce."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Burrito Bites",
        "Ingredients": [
            "1 tbsp olive oil",
            "2 shallots or some onion",
            "2 cloves garlic",
            "Pinch salt",
            "1.5 red peppers",
            "3 tbsp fajita seasoning",
            "3 tbsp mild hot sauce",
            "1 cup black beans",
            "2.5 cups cooked rice",
            "2/3 cup coriander",
            "8 tortilla wraps",
            "Dairy-Free cheese",
            "Guacamole & Hot Sauce for dipping!",
            "Can also add corn, TVP or meatless crumbles, other veggies, or anything else. If you leave out the cheese, I'd really recommend adding in something else.",
            "Method:",
            "In a large pan, warm the oil and cook off the shallots until translucent, then add the garlic and salt and cook for a few more minutes",
            "Add the red pepper and cook until slightly softer, then add the fajita mix and hot sauce and stir in well. Next, mix in the black beans and then the cooked rice. Add the coriander, stir well and take off the heat.",
            "Take out of the oven and serve as nibbles or party food with guacamole and hot sauce!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Spicy, Creamy Cannelloni",
        "Ingredients": [
            "1.5 cups soaked cashews",
            "1/2 cup nut milk",
            "Pinch of salt",
            "2 T nooch",
            "Sautee:",
            "1 T sundried tomato oil",
            "2 shallots or some onion",
            "2 cloves garlic",
            "1 red bell pepper",
            "2 chilis - I use jalapenos",
            "8 sundried tomatoes",
            "Nondairy cheese",
            "Marinara sauce",
            "Red pepper flakes"
        ],
        "Directions": [
            "Add sauteed vegetables to blender, blend everything",
            "Put the filling in cannelloni tubes",
            "Put in pan, coat with olive oil",
            "Top with tomato sauce and red pepper flakes",
            "Cover and bake at 350 for 30 minutes",
            "Top with daiya cheese and put back in for 10 minutes"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cannelloni but with green stuff instead of red",
        "Ingredients": [
            "Ricotta cheese",
            "1.5 cups cashews (soaked in hot water for at least 20 minutes - actually not necessary if you're in a rush)",
            "1/2 cup water",
            "1 lemon (juice)",
            "2 tbsp nutritional yeast",
            "1.5 tbsp olive oil",
            "3 large shallots, minced",
            "3 cloves garlic, minced",
            "1/2 tsp onion powder",
            "1/2 tsp salt",
            "3 cups spinach (Finely chopped)",
            "1/2 cup basil leaves (chopped)",
            "16 cannelloni pasta tubes",
            "Olive oil for greasing",
            "3.5 cups premade marinara sauce (really good quality - roughly 2 cups per jar)",
            "1/2 small block dairy free white cheese (grated)"
        ],
        "Directions": [
            "Put all the Ricotta Cheese ingredients in a blender and whizz them up into a thick cream (it should be the consistency of garlic and herb cheese)",
            "Heat the olive oil in a small saucepan, fry the shallots and garlic until they're nicely cooked",
            "Throw the basil and the spinach into the frying pan and cook everything together until the spinach is well wilted (about 2 minutes)",
            "Put the contents of that pan into the food processor & pulse it in to the 'cheese' (make sure it's only MIXED not blended together - it should be cream with green flecks, not light green)",
            "Put the 'cheese' into a piping bag and pipe it into the tubes of cannelloni pasta so they're well packed",
            "Grease a lasagne dish and place the packed tubes of pasta neatly into it",
            "Pour the tomato sauce over the cannelloni",
            "Sprinkle on the grated cheese",
            "Cover with tin foil, put the dish in the oven and bake for 35 minutes at 180?"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Super easy, fast Mac N Cheese. (Recommended)",
        "Ingredients": [
            "3/4 cup cashews",
            "1/2 cup nutritional yeast",
            "1/2 cup milk",
            "1 t garlic powder",
            "1/2 t tumeric",
            "1 t paprika",
            "1 t chilli powder",
            "1 T of mustard",
            "Juice from 1 lemon",
            "2 t olive oil",
            "1 t salt",
            "1/2 t black pepper",
            "Pasta",
            "Veggies if you want some with the pasta"
        ],
        "Directions": [
            "Cook the pasta and blend all of the other ingredients together in a blender."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Spaghetti Squash Pad Thai (pretty good)",
        "Ingredients": [
            "One spaghetti squash",
            "Sauce:",
            "1/4 cup warm water",
            "3 T soy sauce",
            "1 T sesame oil",
            "2 T agave (I used 1 T maple syrup)",
            "2 T lime juice",
            "1 T sriracha (I used 1 T chili garlic sauce)",
            "1/2 cup peanut butter",
            "1 T ginger (I used ginger powder)",
            "1 T garlic",
            "1 cup cucumber",
            "1 cup carrots",
            "1 cup bell pepper",
            "1/2 cup green onion",
            "1/2 cup onion",
            "1/2 cup chopped peanuts",
            "1/2 cup cilantro"
        ],
        "Directions": [
            "Cook the spaghetti squash",
            "Combine sauce ingredients and stir",
            "Chop up the veggies and put them in a bowl. Take a fork and scoop out the cooked spaghetti squash and add it to the veggies. Add the sauce",
            "Stir and put back into the empty squash shells if you want it to look cool",
            "Notes: I found it to be a bit too watery, maybe don't add the water in the sauce or try to squeeze out some of the water that's in the squash after it's cooked. I would also recommend not adding the cilantro or green onion and putting the pad thai back in the oven for 15-20 minutes once everything is mixed in. Then add the cilantro and green onion."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Marinated Tofu with Grain Salad for packed lunches (Recommended but lots of work)",
        "Ingredients": [
            "For the roast vegetables",
            "1 small butternut squash (cut into 1 inch pieces)",
            "2 red red onion (cut into 1 inch pieces)",
            "2 medium courgettes (cut into 1 inch pieces)",
            "4 small carrots (cut into 1/2 inch pieces)",
            "1/2 tbsp garlic powder",
            "1/2 tbsp dried parsley",
            "2 tsp salt",
            "2 tbsp olive oil",
            "12 sun dried tomatoes",
            "For the white bean, spelt & pea salad",
            "1 can cannellini beans (drained)",
            "1 can butter beans (drained)",
            "200g peas (cooked)",
            "400g spelt (cooked)",
            "2 tbsp sunflower seeds",
            "2 tsp nigella seeds",
            "4 tbsp parsley (finely chopped)",
            "1 tbsp olive oil",
            "1 tbsp lemon juice",
            "1/2 tsp salt",
            "For the salad dressing & marinade",
            "4 tbsp sundried tomato paste",
            "8 cherry tomatoes",
            "2 lemon (juice)",
            "8 tsp olive oil",
            "10 tsp balsamic vinegar",
            "About 3/4 cup water",
            "2 tsp salt",
            "1.5 tsp oregano",
            "2 large garlic clove",
            "1 tsp cayenne pepper",
            "For the tofu steak",
            "1 block firm tofu (pressed and drained)",
            "1/2 salad dressing and marinade",
            "For the hummus",
            "1 can chickpeas (drained)",
            "1 small garlic clove",
            "2 tbsp tahini",
            "4 tbsp water",
            "2 tbsp olive oil",
            "2 tbsp lemon juice",
            "1/2 tsp salt"
        ],
        "Directions": [
            "Put the butternut squash on a baking tray and put it in the oven for 10 minutes at 400F.",
            "Take the butternut squash out of the oven, put all the rest of the Roast Vegetable ingredients on the tray and mix them round with a wooden spoon, ensuring everything is well covered in flavour. Put the tray back in the oven for a further 20-60 minutes.",
            "Put all the White Bean, Spelt and Pea Salad ingredients in a mixing bowl and fold them all together so everything is well mixed. Put the bowl to one side.",
            "Put all the Salad Dressing & Marinade ingredients a food processor and whizz them together to form a liquid and pour half of the liquid into a wide, shallow bowl.",
            "Cut the tofu steak into 4 equal slices and lay them down in the shallow bowl with the Salad Dressing & Marinade liquid in it. Turn the tofu steaks around in the liquid so they're well covered.",
            "Put a griddle pan on the stove, get it quite hot and griddle the steaks so nice griddle lines appear on either side of the steaks. If you have any marinade leftover, pour it over the steaks.",
            "Take the steaks off the griddle pan and set to one side.",
            "Put all the hummus ingredients into a blender and whizz them up into a nice thick creamy hummus.",
            "Take the roast vegetables out of the oven, pour over the sun dried tomatoes and mix them together and put the tray to one side.",
            "Transfer equal amounts of the White Bean, Spelt and Pea Salad into 4 lunch boxes. Add equal amounts of the Roast Vegetables to the lunch boxes. Add equal amounts of the Hummus to the lunch boxes. Place one Tofu Steak to each lunch box. Add equal amounts of the Fresh Salad to the lunch box. Drizzle the remaining Salad Dressing & Marinade over the salad. Lock up your boxes, pop them in the fridge and don't forget to take them to work!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Sweet Potato & Black Bean Enchiladas (Recommended)",
        "Ingredients": [
            "2 cups sweet potato, peeled and chopped small",
            "1 T olive oil",
            "1 red onion, chopped",
            "2 large cloves garlic, minced",
            "Salt and pepper",
            "1 bell pepper, chopped",
            "1 can black beans, drained and rinsed",
            "2 large handfuls spinach, roughly chopped",
            "2.5 cups enchilada sauce (recipe in sauces section)",
            "1 T lime juice",
            "1 t chili powder",
            "1/2 t ground cumin",
            "1/2 t salt",
            "5 tortillas (corn. Would NOT recommend flour)",
            "avocado-cilantro sauce (recipe in sauces section)"
        ],
        "Directions": [
            "Preheat oven to 350F. Lightly grease a large rectangular baking dish.",
            "Place the sweet potato in a medium saucepan and add enough water to cover. Bring the water to a boil, then reduce the heat to medium-high and simmer for 5 to 7 minutes, or until fork tender. Drain and set aside.",
            "In a large skillet, heat the oil over medium heat. Add the onion and garlic and saute for about 5 minutes, until the onion is translucent. Season with salt and pepper.",
            "Add the bell pepper, cooked sweet potato, black beans, and spinach. Raise the heat to medium-high and cook for a few minutes more, or until the spinach is wilted.",
            "Remove the skillet from the heat and stir in 1/4 cup of the enchilada sauce, the lime juice, chili powder, cumin, and salt.",
            "Spread 1 cup of the enchilada sauce evenly over the bottom of the prepared baking dish. Scoop 3/4 cup of the sweet potato filling onto each tortilla. Roll up the tortillas and place them seam side down in the baking dish. Spread the remaining enchilada sauce over the tortillas. If you have leftover filling, spoon it on top of the tortillas as well.",
            "Bake the enchiladas, uncovered, for 20-25 minutes, until the sauce is a deep red color and the enchiladas are heated through.",
            "Meanwhile, make the avocado-cilantro sauce."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Sweet Potato and Peanut Stew (Recommended)",
        "Ingredients": [
            "1 T olive oil",
            "1 T Thai red curry paste",
            "1/2 t cinnamon",
            "1 medium red onion, peeled and diced",
            "4 cloves garlic, minced",
            "1 medium sweet potato, peeled and diced",
            "1 large yellow bell pepper, seeded and diced",
            "1 jalapeno, seeded and diced very finely",
            "1/2 cup dried black beans, soaked overnight and cooked until tender",
            "1 quart veggie broth",
            "1/2 cup peanut butter",
            "1/2 cup boiling water",
            "1/2 t red pepper flakes",
            "2 T fresh cilantro",
            "1 lime",
            "3 t brown sugar",
            "Salt and pepper"
        ],
        "Directions": [
            "Heat the olive oil in a large soup pot. Add the curry paste and cinnamon. Stir for a minute so that the olive oil gets infused with spice. Add the onion, garlic, sweet potato, bell pepper, and jalapeno. Stir and cook the veggies for 5-7 minutes, until softened.",
            "Add the beans and broth. Melt the peanut butter by mixing it with 1/2 cup boiling water. Add to the mix. Add the red pepper flakes and cilantro.",
            "Bring the soup to a boil, then cover and simmer. Cook until veggies are tender, about 25 minutes.",
            "Stir in the lime juice and brown sugar. Season with salt and black pepper."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Spicy Black Bean Taquitos",
        "Ingredients": [
            "Guac Sauce (see recipe in Toppings, Sauces, Sides)",
            "Sour Cream (buy or see recipe in Toppings, Sauces, Sides)",
            "1 small onion, halved",
            "6 green onions coarsely chopped",
            "4 garlic cloves",
            "1/2 t ground cumin",
            "1 t chili powder",
            "2 cups cooked black beans or 1 can (19 oz - Canadian recipe!) rinsed and drained",
            "1 jalapeno pepper, seeded and diced",
            "1 cup thawed frozen corn",
            "1/2 cup diced red bell pepper (about 1/2 pepper)",
            "3 t vegetable oil, plus 1/2 cup for frying",
            "20 (6 inch) corn tortillas"
        ],
        "Directions": [
            "Process the onion halves, green onions, garlic, cumin, and chili powder in a food processor until very finely minced. Add the beans, jalapeno, corn, and bell pepper, and run the food processor a few times just to get everything very finely chopped, but don't process so much that the mixture becomes smooth.",
            "Heat a large cast-iron skillet or heavy-bottomed pan over medium heat with 1 t of the vegetable oil. Add the mixture from the food processor and cook for 3-4 minutes, stirring occasionally, until soft and fragrant.",
            "Pour the mixture into a large bowl. Add the cheese and stir to combine well.",
            "Wipe out the skillet and coat it with 1 t of the vegetable oil heated over medium-low heat. Place 2-3 tortillas in the pan to warm up, flipping once or twice. This step may be unnecessary if you're using flour tortillas or have very fresh corn tortillas. I always find they're a little dry, and this will help with rolling the taquitos. Add the remaining 1 t vegetable oil to the pan after warming a few tortillas, if necessary. As you remove the warmed tortillas from the pan, start rolling them up. Place about 2 T of filling on one-third of a tortilla and shape into a log, rolling tightly and tucking one end under. Place the filled tortillas seam side down on baking sheets.",
            "Once all the tortillas are warmed, leave the pan over the heat and add the 1/2 cup vegetable oil for frying.",
            "Place the taquitos seam side down in the hot frying oil. They should sizzle immediately or else the oil isn't hot enough. Fry in batches for 3-4 minutes, flipping the taquitos halfway through. Lower the heat if necessary. Remove the fried taquitos to paper towels to absorb excess oil.",
            "Serve with guac sauce, sour cream, and nacho cheese if you want."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Southwest Chop Salad",
        "Ingredients": [
            "Ranch Dressing (see Toppings, Sauces, Sides)",
            "1 cup Coconut Bacon (see Toppings, Sauces, Sides - except it's not there yet cuz I'm lazy, so look it up lol)",
            "1 large head romaine lettuce",
            "1 cup finely chopped red onion (about 1 onion)",
            "2 cups fresh or frozen and thawed corn kernels",
            "2 cups cooked black beans, or 1 can (19 oz) black beans, rinsed and drained",
            "2 cups cherry tomatoes",
            "1 large avocado, pitted, peeled, and diced"
        ],
        "Directions": [
            "Assemble each salad with 2 cups of the chopped romaine, 1/4 cup red onion, and 1/2 cup each of the corn, beans, and tomatoes, plus 1/4 the avocado",
            "Top with bacon and ranch dressing."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Bean & Cheese Enchiladas Verdes",
        "Ingredients": [
            "Verde Sauce",
            "1/2 cup raw cashews, soaked in hot water for 20 minutes",
            "1.5 cups salsa verde",
            "1 T lime juice",
            "1/2 cup packed fresh cilantro leaves",
            "Enchiladas",
            "3 T plus 1 t vegetable oil",
            "1/2 cup finely chopped onion (about 1/2 onion)",
            "2 garlic cloves, minced",
            "1/2 t chipotle chile powder",
            "1/2 t salt",
            "1/4 t pepper",
            "1 cup frozen corn, thawed and drained",
            "4 cups spinach",
            "1 cup cooked navy beans or 1 can (15 oz) navy beans, rinsed and drained",
            "cups vegan mozzarella shreds",
            "12 (6 inch) corn tortillas",
            "1 jalapeno chile, thinly sliced and seeded",
            "Toppings",
            "1 avocado",
            "1 green onion",
            "Handful fresh cilantro",
            "Salsa verde",
            "Lime wedges"
        ],
        "Directions": [
            "To make the verde sauce, drain and rinse the cashews. Add to a high-powered blender along with the salsa verde, lime juice, and cilantro. Blend on high until very smooth. Set aside.",
            "Preheat the oven to 375F. Lightly oil a rectangular baking dish about 12 by 18 inches with 1 t of vegetable oil",
            "To prepare the enchiladas, heat a skillet over medium heat with 1 t of the vegetable oil and saute the onion and garlic for 2 minutes until just softened. Stir in the chipotle chile powder, salt, and pepper and cook for another minute. Add the corn and spinach and cook for about 2 minutes until the corn is cooked and the spinach is soft and wilted but still bright green. Stir in the beans and 1 cup mozzarella shreds and cook for another 2 minutes. Remove the filling from the pan to a dish and set aside.",
            "Wipe out the pan and set over medium-low heat. Coat the pan with another T vegetable oil and heat the tortillas in small batches for 1 to 2 minutes, flipping as needed. Add the remaining T of vegetable oil if necessary for the next batches to get the tortillas softened and lightly coated in oil.",
            "Pour a small amount of the verde sauce into the bottom of the oiled baking dish, spreading it out to coat the bottom.",
            "Place about a scant 1/4 cup filling on each tortilla, roll tightly, and arrange seam side down in the dish. Make 2 rows of filled tortillas.",
            "Pour the remaining verde sauce over the enchiladas and top with the remaining 1/2 cup mozzarella shreds and the jalapeno slices. Bake for 15 minutes until the cheese has melted and the edges of the tortillas are just turning golden brown.",
            "Top with diced avocado, green onion, and cilantro. Serve immediately."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Fajita Fiesta Bowls",
        "Ingredients": [
            "Salsa:",
            "1 cup finely diced tomato",
            "1/4 cup finely chopped red onion",
            "1/4 cup chopped cilantro",
            "Juice of 1/2 lime",
            "Salt and pepper",
            "Lime rice:",
            "1.5 cups long-grain white rice",
            "2 cups water",
            "1 garlic clove, minced",
            "1/2 t salt",
            "Juice of 1/2 lime",
            "1/4 cup chopped cilantro",
            "Fajita saute",
            "1 cup thinly sliced red bell pepper",
            "1 cup thinly sliced green bell pepper",
            "1 cup thinly sliced red onion",
            "4 large portobello mushrooms, sliced (about 3 cups)",
            "2 T vegetable oil",
            "1 t chipotle chile powder",
            "1 t salt",
            "1/2 t pepper",
            "Guacamole",
            "1 large ripe avocado",
            "Juice of 1 lime",
            "Salt and pepper",
            "Serve with:",
            "2 cups frozen corn, thawed and drained",
            "Sour cream (see recipe in Toppings, Sauces, Sides, or buy)"
        ],
        "Directions": [
            "To make the salsa, combine the tomato, onion, cilantro, and lime juice in a bowl. Season to taste with salt and pepper. Refrigerate until ready to serve.",
            "To make the lime rice, combine the rice, water, garlic, and salt in a pot, cover, and bring to a boil. Stir, cover again, lower the heat to a simmer, and cook for 10 to 15 minutes. While the rice is still warm, stir in the lime juice and cilantro. Set aside and keep covered. Adjust the water and cooking time for your particular brand of rice.",
            "To make the fajita saute, in a skillet over medium-high heat, saute the bell peppers, onion, and portobellos with the vegetable oil for 3 minutes until the peppers and onions are just softened and the mushrooms are releasing moisture. Add the chipotle chile powder, salt, and pepper and continue cooking for 3-4 minutes until most of the liquid has evaporated or until cooked to your liking.",
            "Make the guacamole right before assembling bowls. Halve and pit the avocados. Scoop the avocado flesh into a bowl and mash with the lime juice, salt, and pepper to taste."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Seitan",
        "Ingredients": [
            "1 cup vital wheat gluten",
            "1/4 cup chickpea flour",
            "1 cup water",
            "6 cups low sodium vegetable broth or water",
            "1/3 cup soy sauce",
            "2 tablespoons maple syrup",
            "2 tablespoons apple cider vinegar",
            "2 teaspoons liquid smoke",
            "2 teaspoons smoked paprika",
            "1 teaspoon onion powder",
            "1 teaspoon garlic powder",
            "6 cups low sodium vegetable broth",
            "1/3 cup soy sauce",
            "1/4 cup nutritional yeast flakes",
            "1 1/2 teaspoons white wine vinegar",
            "1 1/2 teaspoons poultry seasoning",
            "1 teaspoon onion powder",
            "1/2 teaspoon garlic powder",
            "1/2 teaspoon liquid smoke",
            "For the Broth - Beef Flavor",
            "5 1/2 cups low sodium vegetable broth",
            "1/2 cup dry red wine",
            "1/3 cup soy sauce",
            "2 tablespoons vegan Worcestershire sauce",
            "1 teaspoon dried thyme",
            "1/2 teaspoon onion powder",
            "1/2 teaspoon garlic powder",
            "1/2 teaspoon black pepper"
        ],
        "Directions": [
            "Stir the vital wheat gluten and chickpea flour together in a medium bowl.",
            "Add the water and stir to form a soft dough.",
            "Transfer the dough to a work surface and knead it for 5 minutes.",
            "Allow the dough to rest for 5 minutes.",
            "While the dough rests, stir all of the broth ingredients for your choice of broth together in a large pot.",
            "Place the pot over high heat and bring the mixture to a boil. Lower the heat to a low simmer.",
            "Cut the dough into at least 4 large pieces, or if you prefer, smaller strips or chunks.",
            "Add the dough to the broth. It expands as it cooks so cut the pieces smaller than you want them to end up.",
            "Allow the broth to simmer for 1 hour, uncovered, watching closely to ensure it stays at a low simmer (don't allow it to rapidly boil).",
            "Remove the pot from heat and allow it to cool a bit.",
            "When the seitan is cool enough to handle, you can cut it into smaller pieces if you like. Use it in a recipe immediately, or store it in the broth. Refrigerate for up to 5 days, or freeze."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chicken Salad",
        "Ingredients": [
            "1 cup cooked or canned chickpeas, drained, rinsed and lightly mashed",
            "8 ounces seitan (about 1/2 batch if using homemade - recipe above), finely diced",
            "I would tear pieces apart with your hands rather than cutting them with a knife because it gives it a better texture. This is a lot of work, however, and your hands will be sore after.",
            "1/2 cup slivered or sliced roasted almonds",
            "1 cup diced celery (about 2 stalks)",
            "1/3 cup chopped fresh dill",
            "1/4 cup chopped green onion",
            "1 garlic clove, minced",
            "1/2 apple (I added)",
            "cup vegan mayo, more or less depending on taste",
            "2 tablespoons red wine vinegar",
            "Salt and pepper to taste"
        ],
        "Directions": [
            "Place the chickpeas into a medium bowl and roughly mash them with a fork or potato masher.",
            "Add the remaining ingredients and stir until fully mixed.",
            "Taste-test and adjust any seasonings to your liking.",
            "Chill or serve immediately."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Scott's Soup (Scotch Broth)",
        "Ingredients": [
            "Half rutabaga",
            "One large carrot",
            "Two potatoes",
            "One large Leek",
            "Half large onion",
            "1 cup soup mix (red lentils, pearl barley, split peas etc)",
            "Heaped tbsp of Jen's veggie broth powder (see Toppings, Sauces, and Sides)",
            "One veggie stock cube",
            "Approximately 1.2 litres of water, but enough to cover all of the veg by an inch or so.",
            "Salt and pepper"
        ],
        "Directions": [
            "Cube all of the root vegetables and saute with the onion and leek in olive oil for 5 mins.",
            "Add the soup mix, broth powder and the veggie stock cube.",
            "Add the water, bring to a boil and then reduce to a simmer for about an hour until all the veg is soft and the barley is cooked through.",
            "Ta da."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Elvia's Chipotle Salsa (Recommended)",
        "Ingredients": [
            "5 big tomatoes",
            "1 yellow onion",
            "4 garlic cloves",
            "Some chipotle peppers from a can"
        ],
        "Directions": [
            "Broil the tomatoes, onion, and garlic whole (unpeeled - just as they came) in the oven until they start to get burnt",
            "Take them out and peel them. Careful, they will be really hot",
            "Add them to the blender with some chipotle peppers. Start with very few peppers and add more to taste (careful, they're spicy)"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mushroom Gravy (Good for poutine and perogies)",
        "Ingredients": [
            "1 Tablespoon cornstarch",
            "1 Tablespoon cold water",
            "3 tablespoons unsalted butter",
            "1/2 pound mushrooms, sliced or diced however you want",
            "2 cups vegetable stock (if making for perogies, add way less)",
            "1 teaspoon soy sauce (or use Tamari Soy Sauce for Gluten Free)",
            "fresh cracked black pepper, to taste",
            "kosher or sea salt, to taste"
        ],
        "Directions": [
            "Make the cornstarch slurry: In a small bowl, add cornstarch and 1 tablespoon of water. Stir together well and break up all the clumps. Set aside.",
            "Heat a medium saucepan on medium-high heat. Melt butter in pan and then stir in mushrooms.",
            "Cook mushrooms until soft then slowly add vegetable stock, soy sauce and black pepper.",
            "Bring gravy to a gentle simmer and cook for about 3 minutes or until mushrooms are tender. Add the cornstarch mixture and stir well so that no clumps form. Cook until the gravy is thick and remove from heat. Add additional salt to taste."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Jen's Veggie Broth Powder",
        "Ingredients": [
            "2 cups nutritional yeast",
            "1 T salt",
            "2 T onion powder",
            "1 T turmeric",
            "2 t dried dill",
            "2 t dried lemon peel (optional)",
            "1 t celery seed",
            "1 t basil",
            "1 T dried parsley"
        ],
        "Directions": [
            "Place all, except parsley, in a blender in the listed order. Blend until powdered together. Add parsley and pulse to chop. Store in an airtight container indefinitely in the cupboard.",
            "To make veggie broth, add 1 T powder to every quart of water.",
            "Note: If you don't have an ingredient or don't like one, just omit."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Gwen's Amazing Salsa",
        "Ingredients": [
            "1 lb tomatillos",
            "Two small jalapenos, or other hot peppers like pablanos, seeds removed for milder salsa",
            "One medium onion",
            "Bunch of cilantro",
            "1 t salt",
            "Juice of one lime"
        ],
        "Directions": [
            "Broil the tomatillos on high and keep an eye on them and move them around on the tray so they roast evenly. You can also roast the peppers with them to take some heat out of them.",
            "Chop the onion and the cilantro",
            "Throw everything into a food processor with the salt and lime juice. Mix until the right consistency.",
            "Cool and enjoy."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mo & Scott's Easy Cheese Spread",
        "Ingredients": [
            "1/2 cup cashews, soaked",
            "1/2 block tofu, firm",
            "1/2 T lemon juice, plus some",
            "1/2  t salt, give or take",
            "Pinch of pepper",
            "1/2 T apple cider vinegar or some other vinegar",
            "Optional: fresh herbs like parsley, cilantro, basil, dill, chives, green onion, thyme (or dried if necessary); nooch; garlic powder; onion powder; literally anything you want to try"
        ],
        "Directions": [
            "Soak cashews in hot water for a while (longer the better, min 20 minutes)",
            "Blend everything together",
            "Add in fresh herbs after blended",
            "Stays good for a while in fridge"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Quick Pickle Onions (Recommended)",
        "Ingredients": [
            "1 large red onion, sliced in half and halves sliced thin",
            "1/4 cup fresh lime juice or lemon juice (from 2 limes or lemons)",
            "1 T apple cider vinegar",
            "2 t salt",
            "1/4 t sugar"
        ],
        "Directions": [
            "Bring a large pot of water to a boil. Place the onions in a strainer set in the sink and pour the boiling water over the onions. After a few seconds, rinse under cold water.",
            "Stir the lime juice, vinegar, salt, and sugar together in a large bowl, then add the onions. Cover and refrigerate for at least 30 minutes before using (can be refrigerated for up to six weeks)."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "William's Chex Mix (Recommended)",
        "Ingredients": [
            "4 cups corn chex",
            "4 cups rice chex",
            "1 1/2 cup cashews or other nuts",
            "1 1/2 cup pretzels",
            "1/2 cup butter",
            "1 1/2 tbsp brown sugar",
            "1 tbsp paprika",
            "1 1/4 tsp salt",
            "1/2 tsp pepper",
            "1 tsp chili powder",
            "1 tsp onion powder",
            "1 tsp garlic powder",
            "1/4 tsp cayenne or more"
        ],
        "Directions": [
            "Preheat oven to 250",
            "Pour chex, nuts, and pretzels into a very large bowl",
            "Melt the butter and add the spices to the butter",
            "Pour mixture over the chex, nuts, and pretzels",
            "Spread it out on a cookie sheet and bake for 45 minutes, stirring every 15 minutes"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Taco Seasoning",
        "Ingredients": [
            "3 teaspoons of Sea Salt",
            "3 teaspoons of Pepper (I used white pepper instead of black)",
            "1 1/2 teaspoons of Garlic Powder",
            "1 1/2 teaspoons of Onion Powder",
            "1 - 1 1/2 teaspoons Dried Mexican Oregano Leaves",
            "2 teaspoons Paprika",
            "4 1/2 teaspoons of Ground Cumin",
            "3 Tablespoons of Chili Powder",
            "Optional: 3/4 teaspoon Red Pepper Flakes depending on how spicy you want it"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Avocado-Cilantro Sauce",
        "Ingredients": [
            "1/2 cup cilantro",
            "1 medium avocado",
            "2 T lime juice",
            "1/4 tsp sea salt",
            "1/2 tsp garlic powder"
        ],
        "Directions": [
            "Put all ingredients in a food processor until smooth.  Good on enchiladas; burritos; stir-fry (after it's cooked); wraps and sandwiches"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Enchilada Sauce",
        "Ingredients": [
            "2 T vegan butter or oil",
            "2 T flour",
            "4 t chili powder",
            "1 t garlic powder",
            "1 t ground cumin",
            "1/2 t onion powder",
            "1/4 t cayenne pepper",
            "1 scant cup tomato paste",
            "1 3/4 cup vegetable broth",
            "1/4 to 1/2 t salt"
        ],
        "Directions": [
            "In a medium saucepan, melt the butter over medium heat.",
            "Stir in the flour until a thick paste forms. Stir in the chili powder, garlic powder, cumin, onion powder, and cayenne until combined. Cook for a couple of minutes until fragrant.",
            "Stir in the tomato paste, followed by the broth. Whisk until smooth and combined. Bring to a low boil over high heat (covered, if necessary) and then reduce the heat to medium to maintain a simmer. Stir in the salt and simmer for about 5 minutes until thickened."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Thai Peanut Sauce",
        "Ingredients": [
            "2 tablespoons smooth peanut butter",
            "2 tablespoons rice-wine vinegar",
            "1 tablespoon sesame oil",
            "1 tablespoon soy sauce",
            "1 tablespoon brown sugar",
            "1/2 teaspoon chili garlic sauce",
            "1 clove garlic finely minced",
            "1 tablespoon freshly grated ginger",
            "1 tablespoon water"
        ],
        "Directions": [
            "Put all ingredients in food processor until smooth.",
            "Simplify by not including the sesame oil or chili garlic sauce. I eat with fried tofu. Also good on salads."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mexican Tahini Dip",
        "Ingredients": [
            "1 tsp garlic powder",
            "1 tsp onion powder",
            "1 tsp cumin",
            "1 tsp chili powder",
            "1/2 tsp sea salt",
            "2 T fresh lime juice (about 2 limes)",
            "3 T tahini",
            "2 tsp maple syrup (do not omit)",
            "3 T water"
        ],
        "Directions": [
            "Blend all ingredients in a high speed blender or whisk in a bowl until smooth."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Basil Cashew Cheeze Sauce",
        "Ingredients": [
            "1/4 cup vegetable broth or water (or more as needed)",
            "1/4 cup fresh lemon juice 1/2 cup nutritional yeast (gives the cheese flavor)",
            "3/4-1 tsp kosher salt (or to taste) + freshly ground black pepper",
            "1/2 tsp onion powder",
            "1 Tbsp Dijon mustard",
            "2 garlic cloves, peeled",
            "1 1/2 cups fresh basil leaves (lightly packed)",
            "1 cup raw cashews, soaked in water for 30 mins or overnight OR cashew meal from TJs OR almond meal"
        ],
        "Directions": [
            "Drain and rinse the soaked cashews. Add all ingredients (in the order listed) to a high-powered blender and blend until smooth.",
            "Good as a sauce for lasagna; on sandwiches, wraps and pasta."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chipotle Sauce",
        "Ingredients": [
            "1/2 cup vegan mayonnaise",
            "2 tsp. lime juice (fresh is best!)",
            "1 tsp. sugar",
            "1/2 tsp. paprika",
            "1/4 tsp. salt",
            "1/4 tsp. garlic powder",
            "1/4 tsp. ground chipotle chili",
            "Pinch of ground cumin"
        ],
        "Directions": [
            "Mix all ingredients together in a small dish or in a high speed blender. Serve."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chipotle Sauce 2.0 (Recommended)",
        "Ingredients": [
            "1 cup raw cashews (soaked)",
            "1 chipotle pepper in adobe (from can)",
            "1 clove garlic",
            "Juice from one lime",
            "1/4 cup fresh water or more as needed",
            "1/4 t cumin",
            "1/2 t salt",
            "Combine all ingredients in blender. The smaller your blender the smoother it will be. And the more you soak the cashews. I added more cumin, lime juice, and chipotle pepper."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Basic Hummus",
        "Ingredients": [
            "1 15 ounce can chickpeas drained (1 3/4 cups homemade)",
            "1/4 cup tahini",
            "2 tablespoons lemon juice",
            "1 tablespoon garlic, minced",
            "1-2 tablespoons olive oil",
            "salt and pepper to taste"
        ],
        "Directions": [
            "To a food processor or blender, add the chickpeas, tahini, lemon juice, garlic, and salt and pepper. Pulse until well blended. Drizzle in olive oil until desired consistency is reached (hummus will firm up a little after refrigeration). Store in the refrigerator in an airtight container.",
            "Vary in an infinite number of ways...Some add-ins or subs:",
            "adobe chilies (from a can)",
            "black instead of garbanzo beans",
            "sun-dried tomatoes",
            "olives",
            "pine nuts instead of tahini",
            "spinach",
            "basil",
            "cumin"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Kale Pesto",
        "Ingredients": [
            "2 to 3 cloves garlic",
            "3 cups packed kale (about 1 small bunch)",
            "3/4 cup hemp seeds or toasted walnuts or pecans",
            "2 tablespoons lemon juice (about 1 lemon)",
            "3/4 teaspoon fine-grain sea salt",
            "1/4 teaspoon ground pepper",
            "Red pepper flakes, optional (if you want to add some kick)",
            "1/4 cup flaxseed oil or extra-virgin olive oil (more if desired)"
        ],
        "Directions": [
            "In a food processor, add the peeled garlic cloves and process until the garlic is minced.",
            "Add the kale, hemp seeds, lemon juice, salt and pepper.",
            "Turn on the food processor and drizzle in the oil.",
            "Process until the pesto reaches your desired consistency, stopping to scrape down the sides as necessary.",
            "Taste and add more lemon, salt or pepper if necessary. (You can thin out the pesto with more oil, but if you're serving with pasta, keep in mind that you can also thin it out with reserved pasta cooking water.)",
            "Parmesan Cheese (no need to follow precisely. Use whatever nuts you want [not peanuts],)",
            "1/2 cup blanched slivered almonds",
            "1/2 cup raw cashews",
            "1/4 cup nutritional yeast",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon garlic powder",
            "Combine all of the ingredients into the bowl of a food processor fitted with the S blade, or just use a regular blender if it's what you have. Pulse until a fine meal forms. Store covered in the refrigerator for up to 2 months.",
            "Green Smoothie Spices",
            "For one:",
            "1/2 tsp ground turmeric",
            "1/2 tsp cinnamon",
            "1/4 tsp ground cardamom",
            "1/4 tsp ground ginger",
            "1/8 tsp sea salt",
            "1/8 tsp cloves",
            "For a batch to store in a jar:",
            "4 T turmeric",
            "4 T cinnamon",
            "2 T cardamom",
            "2 T ginger",
            "1 T sea salt",
            "1 T cloves",
            "Buttermilk",
            "Place 1 tablespoon lemon juice, lime juice, apple cider vinegar, or white vinegar in a measuring cup.",
            "Add enough non-dairy milk (of your choosing) until it reaches the 1-cup line; stir with a fork or whisk.",
            "Allow mixture to rest for 5-10 minutes.",
            "Coconut Whipped Cream",
            "1. Place a can of coconut milk upside down in the fridge overnight. Get the regular one, not the low fat or light type.",
            "2. About 15 minutes before you're going to make your vegan whipped cream, put your bowl and your blender beaters in the freezer so they get nice and cold!",
            "3. While they're cooling down, prepare some nice sliced fruits (I used organic strawberries!), or get your pie out and ready to top!",
            "4. Open the can and scoop out the thick part, leaving the really liquidy part behind. You'll notice a really nice hard clump on the top of the can, and a decent amount on the bottom too!",
            "5. Place in bowl and add vanilla and sugar to taste. I added 1 teaspoon of vanilla and 2 teaspoons of organic sugar, but we're all different, so add what you think you'll like!",
            "6. Blend! I used a hand held blender & blended about 1 1/2 minutes or so... and you can see the nice consistency I got in the pictures."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Seven Layer Bean Dip (Recommended)",
        "Ingredients": [
            "2 16oz cans refried beans",
            "1/4 cup taco sauce or tomato salsa",
            "2 t chili powder",
            "1 t ground cumin",
            "1.5 cups cooked corn",
            "1/2 cup chopped red bell pepper",
            "1/2 cup chopped green bell pepper",
            "2 jalapeno peppers, seeded and chopped",
            "4 scallions, trimmed and chopped (I always leave this out)",
            "2 T fresh lime juice",
            "Salt and pepper to taste",
            "1 ripe avocado, mashed",
            "1.5 cups vegan sour cream",
            "2.5 cups chopped fresh tomatoes",
            "cup chopped fresh cilantro",
            "3/4 cup nondairy cheese (I always leave this out)"
        ],
        "Directions": [
            "In a bowl, blend refried beans, taco sauce or salsa, chili powder, and cumin",
            "In another bowl, combine corn, bell peppers, jalapenos, scallions, lime juice, salt and pepper",
            "In a small bowl, mix avocado and 2 T of sour cream, season with tabasco",
            "In another bowl, toss together tomatoes and cilantro",
            "To assemble the dip, spread the beans on a serving platter. Spoon the corn and peppers over the beans. Spread the remaining sour cream over the corn, followed by the avocado mixture. Using a slotted spoon, spoon the tomatoes over the top. Sprinkle with cheese. Serve with tortilla chips. Serves 16 as appetizer."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Paula's Dandelion Honey",
        "Ingredients": [
            "Dandelions",
            "Sugar",
            "Water",
            "Lemon juice"
        ],
        "Directions": [
            "Pick a lot of dandelions",
            "Rinse them to get the bugs off",
            "Add the dandelion heads to a pot and add water to the level of the dandelions",
            "Boil them for 45 minutes to an hour.",
            "Let them sit overnight",
            "Strain them through a cloth, keep all of the water, discard the dandelion heads",
            "Add equal parts sugar, and some lemon juice, then boil until you obtain the right consistency. DO NOT LEAVE OUT THE LEMON JUICE, DOING SO WILL RUIN THE HONEY.",
            "Honey will be more liquidy while hot. It will reduce to about ? the size, then start putting a little of the liquid into a dish and letting it cool so you can see what consistency it is. DO NOT OVERCOOK. This will cause the honey to crystalize when it cools. Undercooking will cause it to be too liquidy and not like honey."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Guac Sauce",
        "Ingredients": [
            "2 ripe avocados, pitted and peeled",
            "1/2 cup full-fat coconut milk",
            "1/4 cup lime juice",
            "1 t hot sauce",
            "1/4 t garlic powder",
            "1/4 t onion powder",
            "1/4 t salt",
            "1/4 t pepper"
        ],
        "Directions": [
            "Place all the ingredients in a blender and blend until very smooth. If your coconut milk has separated in the can, make sure the milk and cream are combined before measuring the milk and adding to the blender.",
            "Consume within 2-3 days."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Sour Cream",
        "Ingredients": [
            "1 cup raw cashews soaked in hot water for 20 minutes",
            "1/2 cup unsweetened nondairy milk or water",
            "2 T lemon juice",
            "1/2 t apple cider vinegar",
            "1/2 t onion powder",
            "1/2 t garlic powder",
            "1/4 t salt",
            "1/4 t ground white pepper"
        ],
        "Directions": [
            "Drain and rinse the cashews and place in a high-powered blender with the remaining ingredients. Combine on high until very smooth.",
            "Refrigerate for at least one hour before serving. The sour cream keeps for up to 7 days in the fridge."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Nacho Cheese Sauce (Recommended)",
        "Ingredients": [
            "6 tablespoons vegetable shortening or palm oil",
            "1 small onion, thinly sliced",
            "2 medium cloves garlic, thinly sliced",
            "1/2 teaspoon ground cumin",
            "1 teaspoon ground paprika",
            "1/2 teaspoon granulated garlic powder",
            "1 chipotle pepper packed in adobo sauce, finely chopped, plus 1 teaspoon adobo sauce",
            "4 ounces russet potato (about 1/2 medium), peeled and thinly sliced",
            "4 ounces roasted cashews (about 1 cup)",
            "1/2 cup water",
            "1/2 cup almond milk",
            "1 teaspoon hot sauce (such as Frank's)",
            "Kosher salt to taste"
        ],
        "Directions": [
            "Add potatoes and cashews and cook, stirring, until cashews are lightly toasted, about 2 minutes. Add water and almond milk. Bring to a boil, reduce to a bare simmer, and cook, stirring frequently, until potatoes are fully tender, about 10 minutes.",
            "Press mixture through a chinois (see note), using the bottom of a ladle to get it through. Cheese sauce can be stored in the refrigerator in a sealed container for up to 1 week. To reheat, microwave in 30 second increments, stirring in between, or reheat in a small pan on the stovetop, stirring constantly, and adding extra water to loosen sauce as necessary."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cesar Dressing",
        "Ingredients": [
            "1 garlic bulb",
            "1 T olive oil",
            "2 pinches salt",
            "3/4 cup raw cashews, soaked in hot water for 20 minutes",
            "3/4 cup water",
            "1 pitted medjool date",
            "3.5 T nutritional yeast",
            "1 t salt",
            "1 t pepper",
            "1 t grated lemon zest and 3 T lemon juice",
            "1 T apple cider vinegar",
            "1/2 t Dijon mustard"
        ],
        "Directions": [
            "Preheat the oven to 400F.",
            "Peel the outer layers from the garlic bulb, leaving a thin layer intact. Cut the bulb in half crosswise to expose the cloves. Coat the cloves with olive oil and sprinkle each half with a pinch of salt. Place in a small baking pan and roast for 35 minutes until the cloves are browned and soft to touch.",
            "Remove the roasted cloves from the bulb with a fork and place in a high powered blender.",
            "Drain and rinse the soaked cashews. Place the cashews and the remaining ingredients in the blender and combine on high until very smooth.",
            "The dressing will be slightly warm from the roasted garlic and can be served immediately. Store in fridge and consume within 7 days."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Ranch Dressing",
        "Ingredients": [
            "1 cup vegan mayo",
            "1 T finely chopped fresh dill",
            "1 T finely chopped fresh flat-leaf parsley",
            "1 T finely chopped chives",
            "2 T apple cider vinegar",
            "1 t onion powder",
            "1/4 t salt",
            "1/4 t pepper"
        ],
        "Directions": [
            "Stir all the ingredients together in a bowl until well combined.",
            "Store in fridge for up to 10 days."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Thousand Island",
        "Ingredients": [
            "1 cup vegan mayo",
            "1/4 cup sweet green relish",
            "2 T ketchup",
            "1 T apple cider vinegar",
            "1 T sambal oelek (chile paste) or hot sauce",
            "1 t onion powder",
            "2 T finely chopped chives",
            "1/4 t salt",
            "1/4 t pepper"
        ],
        "Directions": [
            "Stir all the ingredients together in a bowl until well combined.",
            "Store in fridge for up to 10 days."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Creamy Cucumber",
        "Ingredients": [
            "English cucumber",
            "1 cup vegan mayo",
            "2 T lemon juice",
            "2 garlic cloves",
            "2 t apple cider vinegar",
            "1 t finely chopped dill",
            "1/4 t salt",
            "1/4 t pepper"
        ],
        "Directions": [
            "Shred the cucumber. Place in a sieve, nut milk bag, or double layer of cheesecloth and squeeze out the excess water.",
            "Place the cucumber and the remaining ingredients in a high-powered blender and blend until very smooth. You can also combine all the ingredients in a har, but be sure to mince the garlic and chop the shredded cucumber. This will result in a chunkier consistency.",
            "Store in the fridge for up to 10 days. Some of the water from the cucumber may separate. You can shake the dressing to combine again."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mayo",
        "Ingredients": [
            "1/2 cup unsweetened nondairy milk",
            "1/2 t salt",
            "2 t apple cider vinegar",
            "1 t mustard powder or Dijon mustard",
            "1 cup vegetable oil"
        ],
        "Directions": [
            "If using a blender, place all the ingredients except the oil in a high powered blender. Start blending on low while you slowly drizzle in the oil, and then increase the speed until the mayo is thick and fluffy.",
            "If using an immersion blender, place all the ingredients in a tall jar or tall plastic container. Submerge the blender, then turn it on and blend until the mayo is thick and fluffy."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Sundried Tomato Aioli",
        "Ingredients": [
            "1/4 cup dry-packed sundried tomatoes",
            "1/2 cup vegan mayo",
            "2 T lemon juice",
            "1/4 t chili powder",
            "1/4 t mustard powder or Dijon mustard",
            "1/4 t salt",
            "1/4 t pepper"
        ],
        "Directions": [
            "Soak the sundried tomatoes in warm water for 10 minutes and then drain. This helps soften the tomatoes for blending.",
            "Add the sundried tomatoes and remaining ingredients to a high-powered blender and blend until very smooth. Alternatively, use an immersion blender to combine all the ingredients in a tall jar or other container and blend until very smooth."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Horseradish-Dill Aioli",
        "Ingredients": [
            "2/4 cup vegan mayo",
            "1 T vegan horseradish",
            "1 T lemon juice",
            "1 T finely chopped fresh dill",
            "1/4 t pepper"
        ],
        "Directions": [
            "Stir all ingredients together in a bowl until well combined."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Roasted Garlic Aioli",
        "Ingredients": [
            "1 garlic bulb",
            "1 T olive oil",
            "Salt",
            "cup vegan mayo",
            "1 T lemon juice",
            "1/4 t salt",
            "t pepper",
            "t cayenne pepper",
            "1/2 t vegan Worcestershire"
        ],
        "Directions": [
            "Preheat the oven to 400F.",
            "Peel the outer layers from the garlic bulb, leaving a thin layer intact. Cut the bulb in half crosswise to expose the cloves. Coat the cloves with olive oil and sprinkle each half with a pinch of salt. Place in a small baking pan and roast for 35 minutes until the cloves are browned and soft to touch.",
            "Remove the roasted cloves from the bulb with a fork and place in a high powered blender. Add the remaining ingredients and combine on high until smooth."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Jalapeno-Lime Aioli",
        "Ingredients": [
            "1 cup vegan mayo",
            "1/4 cup pickled jalapeno slices, drained",
            "Grated zest and juice of 1 lime",
            "1/4 t chili powder",
            "1/4 t salt"
        ],
        "Directions": [
            "Blend all ingredients in a blender until smooth."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Spicy Sriracha Aioli",
        "Ingredients": [
            "cup vegan mayo",
            "2 T sriracha sauce",
            "1 T lime juice"
        ],
        "Directions": [
            "Stir all ingredients together in a bowl until well combined."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Third Space's Kale Caesar Dressing",
        "Ingredients": [
            "60 g nutritional yeast",
            "600 g olive oil",
            "60 g lemon juice",
            "32 g soy sauce",
            "30 g dijon mustard",
            "2 cloves garlic",
            "1 T salt",
            "1 T pepper",
            "Apple cider vinegar?? maybe"
        ],
        "Directions": [
            "Combine everything"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Coleslaw",
        "Ingredients": [
            "1 cup raw cashews (soaked in very hot water for 1 hour, or in cool water 6 hours or overnight) OR store-bought vegan mayo (if you use mayo, cut down on the amount of vinegar)",
            "1/3 cup water",
            "1 Tbsp maple syrup (plus more to taste // sub sweetener of choice, e.g. stevia or organic cane sugar)",
            "2 tsp spicy brown mustard (or yellow mustard)",
            "1 1/2 Tbsp white vinegar",
            "2 tsp apple cider vinegar",
            "3 Tbsp chopped yellow or red onion",
            "1/2 tsp celery salt (or seeds // if using seeds, add more salt to taste) - I used actual celery",
            "Sea salt and black pepper to taste",
            "2 cups shredded carrot",
            "4 cups packed shredded red or green cabbage"
        ],
        "Directions": [
            "Soak cashews. Then drain thoroughly and add to a high-speed blender along with water, maple syrup, mustard, white vinegar, apple cider vinegar, onion, and celery salt (or seeds).",
            "Blend on high until creamy and smooth, scraping down sides as needed. If too thick, add more water to thin. If too thin, you can compensate by adding more (raw) cashews (they don't need to be soaked).",
            "Taste and adjust flavor as needed, adding salt and pepper to taste,  more celery salt or seeds for more pronounced celery flavor, onion for bite, maple syrup for sweetness, mustard for tanginess, or vinegar for acidity.",
            "Add carrot and cabbage to a mixing bowl and top with dressing. Toss to combine. Enjoy immediately or store covered in the refrigerator to chill - about 4 hours.",
            "Store leftovers covered in the refrigerator up to 4-5 days. Not freezer friendly."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Watermelon Banana Sorbet (Recommended)",
        "Ingredients": [
            "Overripe banana",
            "Watermelon"
        ],
        "Directions": [
            "Freeze overripe banana",
            "Cube and freeze watermelon",
            "Blend watermelon",
            "Blend banana",
            "Blend watermelon and banana together",
            "Eat right away or freeze and then let thaw a few minutes"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Sherri's Snowball Nut Cookies/Mexican Wedding Cookies",
        "Ingredients": [
            "Mix:",
            "2 cups flour",
            "1 cup butter",
            "1/2 cup powdered sugar",
            "cup ground almonds or walnuts",
            "1 tsp vanilla"
        ],
        "Directions": [
            "Mix and form balls[1],[2],. Also recommended to form balls and then put them in the freezer for 15 minutes before the oven so they hold their shape better. Bake at 350 for 15 to 20 minutes. Wait until COMPLETELY cool and then roll or shake in powdered sugar once or twice."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Fluffy Snickerdoodle Cookies",
        "Ingredients": [
            "1/2 cup (112g) Vegan Butter",
            "2/3 cup (132g) White Sugar",
            "1 tsp Vanilla Extract",
            "1 tsp Apple Cider Vinegar",
            "1 and 1/2 cups (188g) All Purpose Flour",
            "1 tsp Cream of Tartar",
            "1 tsp Baking Soda",
            "1 and 1/4 tsp Cinnamon",
            "1/4 tsp Salt",
            "1 Tbsp Soy Milk (or other non-dairy milk)",
            "For Rolling:",
            "3 Tbsp White Sugar",
            "1 tsp Cinnamon"
        ],
        "Directions": [
            "Add the butter and sugar to an electric mixer and cream them together. Add in the vanilla and apple cider vinegar and mix in.",
            "Add in the flour, cream of tartar, baking soda, cinnamon and salt and mix in by hand (don't use an electric mixer for this part) until it forms a crumbly dough.",
            "Then add in the soy milk so that it forms into a proper cookie dough (as pictured in link).",
            "Roll the cookie dough into balls and then roll the balls in the cinnamon and sugar mixture and place them onto a parchment lined baking tray. You can sprinkle more of the cinnamon sugar mixture on top of the balls before they go in the oven.",
            "Bake for 10 minutes."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Bougie Brownies",
        "Ingredients": [
            "1 cup all purpose flour",
            "1/2 tsp. baking powder",
            "1/2 tsp. salt",
            "6 tbsp. brewed espresso or coffee",
            "1 tbsp. vegan butter spread",
            "1/2 cup chocolate chips (vegan)",
            "2 tsp. vanilla extract",
            "1.25 cups sugar",
            "1/2 cup Dutch process cocoa powder",
            "1/3 cup vegetable oil",
            "1/3 cup water",
            "1/2 cup chopped walnuts"
        ],
        "Directions": [
            "1. Preheat the oven to 375.",
            "2. Mix together the flour, baking powder, and salt. Make sure there are no lumps. set aside.",
            "3. Carefully melt together the coffee, butter, and chocolate chips.",
            "4. Once melted, stir in the vanilla extract. Then add the sugar, cocoa powder, oil, and water. Mix until well combined.",
            "5. Gently combine the wet and dry ingredients. Fold in the walnuts.",
            "6. Pour into an 8 X 8 cooking dish. Consider sprinkling a touch of sea salt on top. Bake for 25 minutes or until cooked through."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Less Bougie Brownies",
        "Ingredients": [
            "2 cups unbleached all-purpose flour",
            "2 cups white sugar",
            "3/4 cup unsweetened cocoa powder",
            "1 teaspoon baking powder",
            "1 teaspoon salt",
            "1 cup water",
            "1 cup vegetable oil",
            "1 teaspoon vanilla extract"
        ],
        "Directions": [
            "Combine the dry ingredients, then the wet ones, then bake for 25-30 min at 350. It will probably stick to the pan. I'd recommend eating it out of the pan and not even trying to get it out, or line it with parchment paper completely."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Gramma Kak's Caramel Popcorn",
        "Ingredients": [
            "Popcorn - about 24 cups",
            "2 cubes vegan butter",
            "2 c. brown sugar",
            "1/2 c. light Karo syrup",
            "I also add almonds, pecans, or peanuts"
        ],
        "Directions": [
            "1. Grease two or three 9X13 pans",
            "2. Place butter, sugar, and syrup in a saucepan over medium heat. Once it comes to a boil, cook it for 5 minutes.",
            "3. Pour syrup over popcorn and nuts, stirring well to coat evenly, then put the mixture into the 9 X 13 pans. Bake in a 250 degree oven for 1 hour, stirring every 15 minutes."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Five Minute Vegan Caramel",
        "Ingredients": [
            "1/2 cup pure maple syrup",
            "1/2 cup natural unsalted almond butter",
            "1/3 cup coconut oil",
            "2 teaspoons pure vanilla extract",
            "1/4 teaspoon fine grain sea salt"
        ],
        "Directions": [
            "4. Add all ingredients to a small saucepan. Whisk together over medium low heat until all ingredients are melted together (approximately 3 minutes). Remove from heat and let cool to room temperature.",
            "5. Enjoy over ice cream, apples, or all on its own.",
            "6. Refrigerate leftovers. As the caramel cools, it becomes even thicker. Reheat in a saucepan or enjoy as is!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "SO GOOD BUTTERNUT SQUASH CUPCAKES THE BEST EVER",
        "Ingredients": [
            "1 cup butternut squash puree",
            "To make butternut squash puree, roughly chop up some butternut squash.  Then cook it in the microwave (covered with plastic wrap to keep in the moisture) for about 5-6 minutes until soft. Transfer to a food processor and puree until smooth.  (Or you can mash it with a fork.)",
            "1/3 cup vegetable or canola oil",
            "1/2 cup granulated sugar",
            "1/2 cup brown sugar",
            "1/4 cup nondairy milk",
            "1 tsp. vanilla extract",
            "1 1/4 cups all-purpose flour",
            "1/2 tsp. baking powder",
            "1/2 tsp. baking soda",
            "1 tsp. ground cinnamon",
            "1/4 tsp. ground ginger",
            "1/4 tsp. ground nutmeg",
            "1/4 tsp. salt",
            "Frosting: (this makes WAY too much frosting, maybe only measure out ? of this)",
            "1 block (8 oz.) vegan cream cheese, room temperature",
            "1 stick (1/2 cup) vegan butter, room temperature",
            "2 Tbsp. real maple syrup",
            "1 lb. powdered sugar (or more/less to achieve desired consistency)"
        ],
        "Directions": [
            "Cupcakes:",
            "Preheat oven to 350 degrees. Line baking pan with 12 cupcake liners.",
            "In a medium bowl, stir together butternut squash puree, oil, sugars, milk, and vanilla. Sift in the flour, baking soda, baking powder, salt, and spices. Gently whisk by hand until just combined, being careful not to overmix.",
            "Fill liners with 1/4 cup batter (cups should be approximately 2/3 full). Bake for 22-24 minutes, or until a toothpick inserted into the center comes out clean. Let the cupcakes cool in the pan on a wire rack for 5 minutes. Transfer the cupcakes to the wire rack and let cool completely before frosting.",
            "Frosting:",
            "Using an electric mixer, cream together cream cheese, butter, and maple syrup until smooth and well-combined.",
            "Gradually add in the powdered sugar, mixing well until it's all incorporated. Use a pastry bag to pipe the frosting onto the cupcakes, or spread it on with a knife.",
            "Serve immediately or cover and refrigerate."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Churros",
        "Ingredients": [
            "For the dipping chocolate:",
            "Dark chocolate (chunks, chips, whole bar, idk)",
            "Nondairy milk",
            "Powdered sugar or regular sugar",
            "Vanilla extract",
            "For the topping:",
            "Sugar",
            "Cinnamon",
            "For the churros:",
            "Water",
            "Sugar",
            "Oil",
            "Salt",
            "Vanilla extract",
            "Flour"
        ],
        "Directions": [
            "Heat the chocolate ingredients in a saucepan",
            "Combine the topping and spread out on a plate",
            "Combine the churro ingredients in a saucepan until they stick together and form a ball.",
            "Form churro shapes with the dough with your hands (or whatever shape you want)",
            "Fry them",
            "Roll them in the sugar cinnamon combo"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Freezer PB Fudge (Recommended)",
        "Ingredients": [
            "1/2 cup natural nut butter (we used peanut butter, but feel free to use almond, cashew, or even sunflower seed butter)",
            "2 tablespoons coconut oil, softened or melted",
            "2 tablespoons maple syrup or honey",
            "1/4 teaspoon vanilla extract",
            "Scant 1/4 teaspoon salt"
        ],
        "Directions": [
            "Combine all of your ingredients into a bowl, and stir until well-combined. If you find your fudge is hard to mix, try microwaving the bowl for about 15 seconds - this will make everything smoother.",
            "Pour the fudge into a container lined with plastic wrap or parchment paper. We used a standard bread loaf pan, but even plastic tupperware will work.",
            "Place the container into the freezer and allow 30-40 minutes for the fudge to set.",
            "Also, I like to melt chocolate and drizzle it on top and kinda mix it in so it looks all marbley before freezing."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Lemon Mint Cooler Cookies",
        "Ingredients": [
            "1/2 Cup Non-Dairy Margarine",
            "1/3 Cup Granulated Sugar",
            "Zest of 1 Lemon",
            "2 - 4 Drops Peppermint Oil, or 1/4 - 1/2 Teaspoons Peppermint Extract",
            "1/4 Teaspoon Salt",
            "1 1/2 Cups All Purpose Flour",
            "1/4 Teaspoon Baking Soda",
            "2 Tablespoons Lemon Juice",
            "1/2 Teaspoon Vanilla",
            "1/2 Cup Confectioners Sugar"
        ],
        "Directions": [
            "Preheat your oven to 350 degrees and line two baking sheets with silpats or parchment paper. Set aside.",
            "In the bowl of your stand mixer, thoroughly cream together the margarine and granulated sugar using the paddle attachment. Pause periodically to scrape down the side of the bowl as necessary. Once the mixture is homogeneous and fluffy, add in the lemon zest, peppermint, and salt, and mix to combine. Introduce the flour and baking soda next, starting the mixer on a slow speed until the flour is mostly incorporated, to prevent the dry goods from flying out and re-decorating the kitchen. Finally, add the lemon juice and vanilla. It may seem as though the mixture is too dry to come together, but be patient and keep mixing; it will eventually form cohesive dough. Resist the urge to add more liquid!",
            "Scoop out walnut-sized balls and roll them between your palms to achieve smooth spheres. Place them at least 1-inch apart on your prepared baking sheets, and flatten them out slightly. Bake for 12 - 15 minutes, or until the bottom edges just begin to brown. Carefully pull the cookie-topped silpats or baking sheets off of the hot sheet pans, and let rest for 5 minutes before tossing them in the confectioner's sugar. Let cool completely before enjoying. Better yet, store them in the fridge for an even more cooling treat!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chocolate and Butterscotch Pudding Pie",
        "Ingredients": [
            "For the Chocolate Pudding:",
            "1/2 cup brown sugar",
            "1/3 cup cocoa powder",
            "6 tablespoons cornstarch",
            "2 cups chilled almond milk",
            "For the Butterscotch Pudding:",
            "1/2 cup brown sugar, plus more to taste",
            "6 tablespoons cornstarch",
            "2 cups chilled almond milk",
            "For the Pie:",
            "Vegan pie crust of your choice",
            "Vegan chocolate chips"
        ],
        "Directions": [
            "To make the chocolate pudding, put a 1/2 cup brown sugar in a pot with sifted 1/3 cup cocoa powder and 6 tablespoons cornstarch.",
            "Add 2 cups of cold almond milk and stir constantly while waiting for it to boil.",
            "Once boiling and thickened, pour all of the pudding into your pie crust.",
            "To make the butterscotch pudding, repeat step 1 minus the cocoa. Add more sugar, if desired.",
            "Once boiled and thickened, pour it on top of the chocolate pudding layer.",
            "After it slightly cooled down, throw the vegan chocolate chips on top. Don't wait until the pie is completely cooled down to top with chocolate chips or else they won't stick.",
            "Let the pie cool completely then slice into 8 pieces and serve."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Pie Crust",
        "Ingredients": [
            "1 1/2 cups flour (can be white or whole wheat or combo of both)",
            "1/2 teaspoon salt",
            "2 tablespoons sugar (vegan is best)",
            "1/2 cup oil",
            "2 tablespoons orange juice (or soy milk)"
        ],
        "Directions": [
            "In a large bowl place all of the dry ingredients.",
            "Add Orange Juice and oil, mix with a fork",
            "Pat into 9-inch pan with fingertips. If pre-baked crust is desired bake at 425 for 10 -12 minutes."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Hot Chocolate Cookies (Recommended)",
        "Ingredients": [
            "1 cup brown sugar",
            "1/2 cup white sugar",
            "2 flaxeggs (2 T flaxmeal, 5 T water)",
            "1 stick of butter (1/2 cup)",
            "4 oz unsweetened chocolate (over half a cup)",
            "1 cup flour",
            "1/2 cup cocoa powder",
            "1/2 tsp baking soda",
            "1 Tbsp. cinnamon",
            "1/2 tsp salt",
            "1 tsp chili powder",
            "1/4 tsp cayenne",
            "1/2 cup chocolate chips",
            "12 large vegan marshmallows (optional)"
        ],
        "Directions": [
            "Beat brown sugar, white sugar, and flaxeggs eggs.",
            "Melt the unsweetened chocolate a butter, cool, and mix into the egg and sugar mixture.",
            "Add all of the dry ingredients, and mix thoroughly (you don't want any cayenne pepper clumps!). Stir in the chocolate chips.",
            "Remove the cookies from the oven, top each one with a large marshmallow, and broil for 30 seconds, until the marshmallows have just started to brown."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mud Cookies (Recommended, also known as Haystacks)",
        "Ingredients": [
            "1/2 cup nondairy milk",
            "2 cups sugar",
            "1/2 cup butter",
            "3 T cocoa",
            "1/2 cup peanut butter",
            "1 t vanilla",
            "3 cups quick oats"
        ],
        "Directions": [
            "In saucepan, combine milk, sugar, butter, cocoa",
            "Place pan on stove top and bring mixture to boil, stirring frequently. Once boiling, continue to heat for one minute",
            "Remove pan from stove top and stir in peanut butter and vanilla. Then add oats.",
            "Drop mixture by teaspoonfuls onto wax paper. Allow to cool."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Bryanna's Pumpkin Pie",
        "Ingredients": [
            "Heat oven to 350. Have ready one 9 pastry crust.",
            "Blend in blender:",
            "2 cups solid pack canned pumpkin",
            "1 cup nondairy milk",
            "3/4 cup brown sugar",
            "1/4 cup cornstarch",
            "1 T molasses",
            "1 t ground cinnamon",
            "1 t vanilla",
            "1/2 t EACH ground ginger, nutmeg, salt",
            "1/4 t ground allspice or cloves"
        ],
        "Directions": [
            "Pour the filling into the pastry and bake 60 minutes, covering the edges with foil if they begin to brown too quickly. Refrigerate overnight before serving."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Thumbprint Cookies",
        "Ingredients": [
            "1 3/4 cups all-purpose flour",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon fine salt",
            "3/4 cup unsalted butter (1 1/2 sticks), softened",
            "2/3 cup sugar, plus more for rolling",
            "1 flaxegg (1 T flaxmeal + 2.5 T water)",
            "1 teaspoon pure vanilla extract",
            "1/3 cup raspberry, cherry or strawberry jam*",
            "*You can also fill with chocolate instead: mix cocoa powder, powdered sugar, and a small amount of water together to create chocolate spread"
        ],
        "Directions": [
            "Preheat oven to 350 degrees F. Line 2 baking sheets with parchment paper or silicone mats.",
            "Whisk the flour, baking powder and salt together in a bowl.",
            "In another bowl, whip the butter and the sugar with a hand-held mixer until fluffy, about 5 minutes. Beat in the flaxegg and vanilla until just combined. Slowly beat in the dry ingredients in 2 additions, mixing just until incorporated.",
            "Scoop the dough into 1-inch balls with a cookie or ice cream scoop and roll in sugar. Place about 2-inches apart on the prepared baking sheets. Press a thumbprint into the center of each ball, about 1/2-inch deep. Fill each indentation with about 3/4 teaspoon jam.",
            "Bake cookies until the edges are golden, about 15 minutes. (For even color, rotate the pans from top to bottom about halfway through baking.) Cool cookies on the baking sheets."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Fudgy Beet Cupcakes",
        "Ingredients": [
            "1 cup unsweetened vanilla almond milk",
            "1 tsp white or apple cider vinegar",
            "3/4 cup raw turbinado OR granulated sugar",
            "1/4 cup avocado or melted coconut oil",
            "2 tsp pure vanilla extract",
            "1 heaping cup whole-wheat pastry flour or unbleached all-purpose flour",
            "1/2 scant cup unsweetened cocoa powder (plus more for topping)",
            "1 tsp baking soda",
            "1/2 tsp baking powder",
            "1 pinch salt"
        ],
        "Directions": [
            "Preheat oven to 375 degrees F (190 C), remove the stem and most of the root from your beets, and scrub and wash them underwater until clean.",
            "Wrap beet(s) in foil, drizzle on a bit of olive or avocado oil, wrap tightly, and roast for one hour or until a knife inserted falls out without resistance. They should be tender. Set in the fridge (in a bowl to catch juice) to cool to room temperature.",
            "Once cooled, either finely grate or puree beets in a small blender (adding orange juice or water to encourage mixing). Measure out 1/2 cup and set aside (amount as original recipe is written // adjust if altering batch size). Reserve the rest for things like beet hummus!",
            "Line a muffin pan with paper liners.",
            "Whisk together the almond milk and vinegar in a large bowl, and set aside for a few minutes to curdle. Add the sugar, oil, vanilla extract, and 1/2 cup beets (amount as original recipe is written // adjust if altering batch size) and beat until foamy.",
            "Add the flour, cocoa powder, baking soda, baking powder, and salt to a sifter and slowly sift it into the wet ingredients while mixing with a hand-held or standing mixer. Beat until no large lumps remain.",
            "Pour batter into liners, filling 3/4 of the way full. Bake 22 to 25 minutes, or until a toothpick inserted into the center comes out clean. Transfer to a cooling rack and let cool completely. Do not try and unwrap them or they'll stick to the wrapper.",
            "Once cooled, dust with cocoa powder and store in an airtight container to keep fresh."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Soft Pretzels (Recommended)",
        "Ingredients": [
            "1 tablespoon maple syrup",
            "1/2 package (1/2 tablespoon) active dry yeast",
            "3/4 cup water (1/4 cup for proofing, 1/2 cup for dough)",
            "2 tablespoons olive oil or canola oil",
            "2 cups all-purpose flour",
            "1 teaspoon sea salt",
            "2 tablespoons baking soda (this is for the boiling water NOT the dough)",
            "6 cups water, in a pot (for boiling)",
            "Coarse salt (for sprinkling)"
        ],
        "Directions": [
            "Proof the yeast: Put 1/4 cup warm water, maple syrup, and yeast into a small cup and stir until yeast dissolves. If yeast does not foam, try again with another yeast packet.",
            "Make the dough: If you have a mixer with a dough hook, put the flour, salt, oil, proofed yeast mixture, and an additional 1/2 cup of water (for a total of 3/4 cups water) into the mixer. Run on medium low for about 5-6 minutes (until the dough pulls away from the bowl). If you don't have a dough hook, mix and knead dough ingredients for about 8-10 minutes.",
            "Brush the inside of a large glass bowl with a little bit of oil. Form the dough into a ball and put it in the bowl. Cover and allow the dough to rise for about 40 minutes, or until it has doubled in size.",
            "Preheat your oven to 450 degrees F.",
            "Uncover your dough and punch it down few times. Really let it have it.",
            "Prepare a cookie sheet with parchment paper on it. Set aside.",
            "Prepare an oiled work surface. Cut the dough into 4 or 6 equal sections (depending on the size you want your pretzels), and roll each out to an approx. 18-24 inches long rope.",
            "Grab the ends of each dough rope to make a U shape, then form into a pretzel shape.",
            "Put 6 cups of water into a pot and dissolve the 2 tablespoons of baking soda into the water and bring to a rolling boil.",
            "Drop pretzels, one at a time, into the pot (get close so it doesn't splash!). Each should sink a little then rise up. Wait 30 seconds, then lift out using a slotted spoon and place each onto the cookie sheet. While still wet, sprinkle liberally with coarse salt. Take a sharp knife and cut a 4-6 inch slit along the bottom of the pretzel. (This slit will open up during baking).",
            "Bake for about 14 minutes. Watch them like a hawk - when they're golden brown, they're done."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mug Cake",
        "Ingredients": [
            "3 T flour",
            "3 T brown sugar",
            "3 T cocoa powder",
            "3 T oil",
            "3 T water",
            "Pinch of salt",
            "1/2 t vanilla extract",
            "2 t chocolate chips"
        ],
        "Directions": [
            "Combine all ingredients into mug and microwave for about one minute"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Soft-Baked Sugar Cookies",
        "Ingredients": [
            "4 cups unbleached, all-purpose flour",
            "2 teaspoons baking powder",
            "1.5 teaspoons baking soda",
            "2 teaspoons sea salt",
            "6 tablespoons sprinkles",
            "2 cups organic cane sugar",
            "1 cup neutral vegetable oil",
            "1/2 cup water",
            "2 teaspoons apple cider vinegar",
            "1 teaspoon vanilla extract"
        ],
        "Directions": [
            "In a large bowl, whisk together flour, baking powder, baking soda, and salt. Add the sprinkles to the flour mixture and toss to coat.",
            "In a separate bowl, whisk together sugar with oil, water, apple cider vinegar, and vanilla extract until smooth and incorporated.",
            "Add wet ingredients to the flour mixture and stir until well combined. Cover bowl with plastic wrap and refrigerate the dough for one hour. (You can skip this step, but it keeps the cookies from spreading too much when baked.)",
            "Preheat the oven to 375 F. Line two rimmed cookie sheets (one half sheet if you have it) with parchment paper. Remove dough from the refrigerator and use an ice cream scoop or 2 tablespoon measuring spoon to portion dough into small mounds. Press down gently on the mounds with your palm to flatten slightly. Fill one sheet with 12 cookies and use remaining dough on second sheet. (Keep the second sheet refrigerated while the first batch bakes.)",
            "Bake for 8 to 10 minutes. The cookies should be puffed up and very lightly browned on the bottom (but not on the edges or tops). Remove from oven and allow to cool on the pan for 2 minutes before removing to a cooling rack. Repeat with remaining sheet.",
            "Cookies will deflate slightly while cooling. Store in an airtight container for up to 5 days."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Peanut Butter Cookies",
        "Ingredients": [
            "1 Tbsp ground flax seed",
            "3 Tbsp water",
            "1/2 cup cold vegan margarine (I used Earth Balance)*",
            "1/2 cup vegan granulated sugar or coconut sugar",
            "1/3 cup packed light brown sugar",
            "1 tsp vanilla extract",
            "3/4 cup natural peanut butter",
            "1 2/3 cup all purpose flour",
            "1 tsp baking soda",
            "1/2 tsp salt",
            "1/8 tsp ground nutmeg"
        ],
        "Directions": [
            "Combine the flax seed and water in a small bowl and set aside.",
            "Add the margarine and sugars to a large bowl (preferably that of a stand mixer) and beat with the paddle attachment on medium speed until homogeneous and fluffy, about 3 minutes. If you don't have a stand mixer, grab a whisk and get ready for an arm workout.",
            "Scrape down the sides of the bowl, then add the flax mixture and the vanilla extract. Beat another 2 minutes or so until everything is well mixed. Add the peanut butter and beat until combined.",
            "While things are beating, combine the flour, baking soda, salt, and nutmeg.",
            "Add the dry ingredients to the wet and mix only until just combined.",
            "Place a bit of sugar in a small bowl. Roll a tablespoon of dough between your palms to form a ball, then roll in the sugar. Place on a silicone baking mat or parchment-lined cookie sheet, then use a fork to flatten.",
            "Position the flattened cookies about 1.5? apart.",
            "Bake the cookies for 11-12 minutes until just starting to turn golden. Let sit on the cookie sheet for about 5 minutes, then transfer to a rack to cool."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Ma's Granola Squares",
        "Ingredients": [
            "1 cup all-purpose flour",
            "1 cup quick-cooking rolled oats",
            "cup packed brown sugar",
            "1/4 teaspoon baking soda",
            "1/2 cup butter",
            "Some jam (idk how much, a cup?)"
        ],
        "Directions": [
            "Preheat oven to 350 degrees F. In a medium bowl combine flour, oats, brown sugar, and baking soda. Using a pastry blender, cut in butter until mixture resembles coarse crumbs. Set aside 1/2 cup of the crumb mixture.",
            "Press the remaining crumb mixture into the bottom of an ungreased 9x9x2-inch or 11x7x1-1/2-inch baking pan. Spread with desired filling. Sprinkle with reserved crumb mixture. Bake for 30 to 35 minutes or until top is golden. Cool in pan on a wire rack. Cut into bars."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cheerio Treats",
        "Ingredients": [
            "5 cups cheerios",
            "12 ounces (about 4-4.5 cups) vegan marshmallows",
            "3 T vegan butter",
            "1/2 cup peanut butter"
        ],
        "Directions": [
            "Melt butter on the stove (or microwave). then add marshmallows until melted, stirring constantly",
            "You want them as mushed up as possible to be able to surround each cheerio",
            "Take off heat and stir in PB",
            "When well mixed, add cheerios",
            "Makes a 9x13 pan"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mo & Scott's Easy Cheese Spread",
        "Ingredients": [
            "1/2 cup cashews, soaked",
            "1/2 block tofu, firm",
            "1/2 T lemon juice, plus some",
            "1/2  t salt, give or take",
            "Pinch of pepper",
            "1/2 T apple cider vinegar or some other vinegar",
            "Optional: fresh herbs like parsley, cilantro, basil, dill, chives, green onion, thyme (or dried if necessary); nooch; garlic powder; onion powder; literally anything you want to try"
        ],
        "Directions": [
            "Soak cashews in hot water for a while (longer the better, min 20 minutes)",
            "Blend everything together",
            "Add in fresh herbs after blended",
            "Stays good for a while"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Fluffy Pancakes (Recommended)",
        "Ingredients": [
            "1 cup flour",
            "1 tablespoon baking powder",
            "1/4 teaspoon salt",
            "1 cup dairy-free milk",
            "2 tablespoons oil",
            "2 tablespoons maple syrup or sugar",
            "1 teaspoon vanilla extract"
        ],
        "Directions": [
            "Mix together the flour, baking powder and salt.",
            "Mix together the milk, oil, maple syrup and vanilla extract in a separate bowl",
            "Pour the liquid mixture into the dry mixture. Stir until combined, so only a few lumps remain (don't over-mix or your pancakes will be tough!)"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Chickpea Mash (Recommended)",
        "Ingredients": [
            "2 cups cooked garbanzo beans aka chickpeas, 430g",
            "1/4 cup red onion 35g, diced",
            "1/4 cup grated carrot 30g",
            "1/2 cup celery 50g, chopped",
            "2 teaspoons yellow mustard 15g",
            "1 tablespoon lemon juice 15ml",
            "5 turns fresh black pepper",
            "1/2 teaspoon sea salt"
        ],
        "Directions": [
            "Place the garbanzo beans in a medium-sized bowl and mash them with a fork. You don't have to mash them completely. If some garbanzo beans are left whole, it's totally fine.",
            "Add the red onion, carrot, celery, yellow mustard, lemon juice, black pepper and sea salt.",
            "Stir until all of the ingredients are combined.",
            "Serve on toasted sprouted grain bread or on cucumber rounds as a snack or appetizer. You can also put it in a sprouted grain tortilla or blanched collard leaf with some mixed greens and avocado and make a crazy delicious wrap."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Pumpkin-Seed Alfredo Pasta (Recommended)",
        "Ingredients": [
            "One box pasta",
            "For the alfredo:",
            "1 tsp oil",
            "1/2 cup chopped onion or shallots",
            "3 fat cloves of garlic",
            "1/4 cup raw pumpkin seeds or cashews",
            "1/2 cup water divided",
            "3 tbsp nutritional yeast",
            "1/4 tsp or more dried thyme",
            "1/4 tsp dried basil or oregano",
            "3/4 tsp or more salt",
            "1.5 to 2 tsp fresh lemon juice",
            "1/2 tsp white vinegar",
            "1 tbsp flour",
            "Some pepper",
            "2 tsp extra virgin olive oil",
            "1 cup unsweetened non dairy milk",
            "Add peas or spinach or broccoli or other veggies"
        ],
        "Directions": [
            "Cook pasta according to instructions and keep aside.",
            "Heat oil in a skillet over medium heat. Add onions and garlic and cook until translucent. 3 to 4 minutes.",
            "Add pumpkin seeds and 1/4 cup water and bring to a boil. about 4 minutes. Cook for 2 more minutes, then let it cool a bit.",
            "Meanwhile add all the ingredients from nutritional yeast through non dairy milk to the blender (nutritional yeast, herbs, salt, lemon, vinegar, flour, pepper, olive oil, non dairy milk). Add the onion pumpkin seed mixture to the blender. Blend until smooth.",
            "Return to the skillet over medium heat. Add another 1/4 cup water. Bring to a boil. Stir frequently to avoid lumps. The mixture will thicken considerably. Cook for another minute, so the flour is cooked through. Total 3 to 4 minutes. Carefully taste and adjust the salt and tang. Add more herbs if you wish."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cranberry Walnut Chickpea Salad Sandwich",
        "Ingredients": [
            "3 cups cooked or 2 cans (15 oz) garbanzo beans (chickpeas), drained and rinsed",
            "1 cup celery, diced",
            "1/2 cup organic dried cranberries (chopped fresh would be great too)",
            "1/2 cup walnuts or pecans, roughly chopped",
            "1/2 cup scallions (green onions), thinly sliced, white & green parts",
            "mineral salt & freshly ground pepper, to taste (I used about 1/2 teaspoon each)",
            "Dressing:",
            "6 tablespoons (1/3 cup) tahini or vegan mayo",
            "4 tablespoons (1/4 cup) champagne, white wine or cider vinegar (I used Orange Muscat Champagne Vinegar)",
            "2 tablespoons water (only needed if using tahini)",
            "2 teaspoons pure maple syrup",
            "To serve:",
            "leafy lettuce of choice",
            "bread of choice"
        ],
        "Directions": [
            "Start by mixing your dressing. In a small bowl combine tahini/mayo, vinegar, water and maple syrup. Set aside so the flavors come together. This can be made a day or two ahead and stored in the refrigerator until ready to use. Add a tad more water, or vinegar if you're a vinegar lover, to thin out dressing as desired. If using vegan mayo, you may like to add 2 more tablespoons.",
            "In a medium to large bowl, add your garbanzo beans and roughly mash with a strong fork or potato masher. Add in celery, cranberries, nuts, scallions, salt, pepper and dressing, mix well. Serve at room temp or let chill in the refrigerator for an hour before serving.",
            "Serve on your favorite bread as a closed or open faced sandwich, or on a bed of leafy greens. You may even opt to simply enjoy the salad as is."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Carrot Fries (Recommended)",
        "Ingredients": [
            "2 carrots",
            "2 tablespoons olive oil",
            "1 tablespoon fresh parsley, chopped",
            "1 teaspoon paprika",
            "1 teaspoon salt",
            "1 teaspoon pepper",
            "Greek yogurt chive dip:",
            "1 cup plain vegan greek yogurt",
            "1 tablespoon lemon juice",
            "2 tablespoons chives",
            "1/4 teaspoon salt",
            "1/4 teaspoon pepper"
        ],
        "Directions": [
            "Cut carrots into fries and combine in a large bowl with olive oil, parsley, paprika, salt, and pepper.",
            "Place on baking sheet lined with parchment paper in a single layer. Bake for 20-25 minutes, flipping halfway.",
            "Prepare dip while fries are baking. Combine all dip ingredients in a small bowl and set aside in the refrigerator until ready to use."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "10 Minute Mac-n-Cheese",
        "Ingredients": [
            "8 oz. favorite pasta",
            "1 1/4 cups unsweetened almond milk (at room temperature)",
            "2 tablespoons olive oil",
            "2 heaping tablespoons flour",
            "1/4 - 1/2 cup nutritional yeast flakes",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon chili powder",
            "1/4 teaspoon chipotle powder",
            "mineral salt, to taste"
        ],
        "Directions": [
            "Cook your pasta according to package. Drain and place back in pot, set aside.",
            "In a small/medium saucepan, heat oil over medium heat, add flour and whisk to incorporate. Continue whisking and cook for 2 minutes. Add milk slowly, whisking constantly. Turn heat to low and cook until sauce thickens, about 8 minutes, stirring frequently. Remove from heat. Stir in nutritional yeast, salt, garlic powder, chili powder and chipotle powder. Stir until everything is incorporated and smooth again. Taste for flavor.",
            "Add sauce to the pasta, toss well, add more milk as needed and serve right away."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mo's Tacos",
        "Ingredients": [
            "Add lime juice (not necessary) and if you have taco seasoning or cumin or something, you could add that too",
            "Heat up some refried beans",
            "Get some tortillas",
            "Put the veggies and beans in the tortillas. If you're feeling like you wanna waste some money you could add Daiya cheese.",
            "Clean off the pan you just used and put the tacos on the pan until they're toasted",
            "Add hot sauce - would recommend Frank's red hot sauce"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Super easy, fast Mac N Cheese",
        "Ingredients": [
            "3/4 cup cashews",
            "1/2 cup nutritional yeast",
            "1/2 cup milk",
            "1 t garlic powder",
            "1/2 t tumeric",
            "1 t paprika",
            "1 t chilli powder",
            "1 T of mustard",
            "Juice from 1 lemon",
            "2 t olive oil",
            "1 t salt",
            "1/2 t black pepper",
            "Pasta",
            "Veggies if you want some with the pasta",
            "Cook the pasta and blend all of the other ingredients together in a blender."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Five Minute Vegan Caramel",
        "Ingredients": [
            "1/2 cup pure maple syrup",
            "1/2 cup natural unsalted almond butter",
            "1/3 cup coconut oil",
            "2 teaspoons pure vanilla extract",
            "1/4 teaspoon fine grain sea salt"
        ],
        "Directions": [
            "Add all ingredients to a small saucepan. Whisk together over medium low heat until all ingredients are melted together (approximately 3 minutes). Remove from heat and let cool to room temperature.",
            "Enjoy over ice cream, apples, or all on its own.",
            "Refrigerate leftovers. As the caramel cools, it becomes even thicker. Reheat in a saucepan or enjoy as is!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Freezer PB Fudge (Recommended)",
        "Ingredients": [
            "1/2 cup natural nut butter (we used peanut butter, but feel free to use almond, cashew, or even sunflower seed butter)",
            "2 tablespoons coconut oil, softened or melted",
            "2 tablespoons maple syrup or honey",
            "1/4 teaspoon vanilla extract",
            "Scant 1/4 teaspoon salt"
        ],
        "Directions": [
            "Combine all of your ingredients into a bowl, and stir until well-combined. If you find your fudge is hard to mix, try microwaving the bowl for about 15 seconds - this will make everything smoother.",
            "Pour the fudge into a container lined with plastic wrap or parchment paper. We used a standard bread loaf pan, but even plastic tupperware will work.",
            "Place the container into the freezer and allow 30-40 minutes for the fudge to set.",
            "Also, I like to melt chocolate and drizzle it on top and kinda mix it in so it looks all marbley before freezing."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mud Cookies",
        "Ingredients": [
            "1/2 cup nondairy milk",
            "2 cups sugar",
            "1/2 cup butter",
            "3 T cocoa",
            "1/2 cup peanut butter",
            "1 t vanilla",
            "3 cups quick oats"
        ],
        "Directions": [
            "In saucepan, combine milk, sugar, butter, cocoa",
            "Place pan on stove top and bring mixture to boil, stirring frequently. Once boiling, continue to heat for one minute",
            "Remove pan from stove top and stir in peanut butter and vanilla. Then add oats.",
            "Drop mixture by teaspoonfuls onto wax paper. Allow to cool."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mug Cake",
        "Ingredients": [
            "3 T flour",
            "3 T brown sugar",
            "3 T cocoa powder",
            "3 T oil",
            "3 T water",
            "Pinch of salt",
            "1/2 t vanilla extract",
            "2 t chocolate chips (optional)",
            "Combine all ingredients into mug and microwave for about one minute (I often microwave for 75 seconds)",
            "Sarah's alternative:",
            "2 T flour",
            "2 T sugar",
            "2T cocoa powder",
            "1/8 t salt",
            "1/4 t baking powder",
            "1 T canola",
            "3 T nondairy milk",
            "1/2 t vanilla",
            "2 T chocolate chips (optional)",
            "Microwave for one minute"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Coleslaw",
        "Ingredients": [
            "1 cup raw cashews (soaked in very hot water for 1 hour, or in cool water 6 hours or overnight) OR store-bought vegan mayo (if you use mayo, cut down on the amount of vinegar)",
            "1/3 cup water",
            "1 Tbsp maple syrup (plus more to taste // sub sweetener of choice, e.g. stevia or organic cane sugar)",
            "2 tsp spicy brown mustard (or yellow mustard)",
            "1 1/2 Tbsp white vinegar",
            "2 tsp apple cider vinegar",
            "3 Tbsp chopped yellow or red onion",
            "1/2 tsp celery salt (or seeds // if using seeds, add more salt to taste) - I used actual celery",
            "Sea salt and black pepper to taste",
            "2 cups shredded carrot",
            "4 cups packed shredded red or green cabbage"
        ],
        "Directions": [
            "Soak cashews. Then drain thoroughly and add to a high-speed blender along with water, maple syrup, mustard, white vinegar, apple cider vinegar, onion, and celery salt (or seeds).",
            "Blend on high until creamy and smooth, scraping down sides as needed. If too thick, add more water to thin. If too thin, you can compensate by adding more (raw) cashews (they don't need to be soaked).",
            "Taste and adjust flavor as needed, adding salt and pepper to taste,  more celery salt or seeds for more pronounced celery flavor, onion for bite, maple syrup for sweetness, mustard for tanginess, or vinegar for acidity.",
            "Add carrot and cabbage to a mixing bowl and top with dressing. Toss to combine. Enjoy immediately or store covered in the refrigerator to chill - about 4 hours.",
            "Store leftovers covered in the refrigerator up to 4-5 days. Not freezer friendly."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Charoset",
        "Ingredients": [
            "3 medium gala or fuji apples, peeled, cored, and finely diced",
            "1.5 cups walnut halves, lightly toasted, cooled, and coarsely chopped",
            "1/2 cup Manischewitz or another sweet wine (your local store should have Manischewitz and this is what I'd recommend buying. It's usually pretty cheap and it's what you're supposed to drink for Pesach anyway. Although you guys likely won't like it so also get some less sweet wine)",
            "1.5 t ground cinnamon",
            "1 T packed brown sugar",
            "Stir together all ingredients and store at room temperature."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Falafel Sandwich (Recommended)",
        "Ingredients": [
            "1 15-oz can unsalted chickpeas, ?drained and rinsed",
            "1/4 yellow onion, cut into 3 or 4 chunks",
            "1/4 cup whole-wheat pastry flour",
            "2 tbsp fresh flat-leaf parsley",
            "4 cloves garlic, divided (NOTE: Leave 2 cloves whole and mince 2 cloves.)",
            "1 tsp sodium-free baking powder",
            "1/2 tsp ground cumin",
            "1/2 tsp ground coriander",
            "1/2 tsp sea salt",
            "Olive oil cooking spray",
            "1/4 cup tahini paste",
            "2 tbsp fresh lemon juice",
            "1/4 tsp paprika",
            "6 6-inch whole-wheat pitas",
            "1 head green leaf or red leaf lettuce, ? coarsely shredded",
            "1 tomato, cut into thin wedges",
            "1/2 cucumber, peeled and sliced",
            "1 low-sodium dill pickle, sliced",
            "1/4 small red onion, thinly sliced",
            "Harissa or other hot sauce, optional"
        ],
        "Directions": [
            "To a food processor, add chickpeas, yellow onion, flour, parsley, whole garlic, baking powder, cumin, coriander and salt and pulse to a grainy paste, scraping down bowl as necessary.",
            "With lightly moistened hands, shape paste into 12 golf ball-size rounds, arranging on a cookie sheet. Cook falafel for like 15 minutes or until you can pick them up without them falling apart.",
            "Coat a very large nonstick skillet with cooking spray and heat on medium-low. Working in batches if necessary to avoid crowding the skillet, add balls and use a spatula to flatten to about 1/2 inch thick. Cook until browned on bottom, 4 to 5 minutes. Flip and brown other side, 4 to 5 minutes.",
            "Meanwhile, in a small bowl, whisk together tahini, 1/4 cup water, lemon juice, remaining minced garlic and paprika.",
            "Cut about 1 inch off top of each pita, forming a pocket. Add 2 falafel to each pita and divide lettuce, tomato, cucumber, pickle, red onion and tahini sauce among pitas. Drizzle each with harissa (if using)."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Latkes for Chanukah",
        "Ingredients": [
            "3 pounds of potatoes makes 25 latkes",
            "potatoes",
            "onion",
            "flour",
            "salt"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Israeli Couscous Salad",
        "Ingredients": [
            "One box Israeli couscous",
            "2 extra large cucumbers",
            "1/2 red onion",
            "1 red bell pepper",
            "1 yellow bell pepper",
            "1/2 cup herbs (Italian parsley, mint, cilantro, any combo)",
            "Zest of one lemon",
            "Lemon juice (start with 1/2 lemon)",
            "4 tablespoons olive oil",
            "Salt and pepper"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Tabouli",
        "Ingredients": [
            "Wheat bulgur",
            "Cucumber",
            "Tomato",
            "Parsley",
            "Mint",
            "Lime juice",
            "Olive oil",
            "Salt"
        ],
        "Directions": [],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mira's Challah",
        "Ingredients": [
            "1 1/4 cups lukewarm water",
            "2 1/2 teaspoons active dry yeast",
            "6 tablespoons sugar",
            "1/4 cup oil (neutral-flavored such as grapeseed or canola, plus additional for oiling the bowl)",
            "4 to 4 1/2 cups all-purpose flour",
            "2 teaspoons salt (kosher salt or pink Himalayan sea salt)"
        ],
        "Directions": [
            "Place the warm water in a large bowl or stand mixer. Add a pinch of the sugar to the bowl, and sprinkle with the yeast. Set aside in a warm place for 5 to 10 minutes, until the mixture is foamy. (If your yeast doesn't proof properly, discard the mixture and start again with fresh yeast).",
            "Mix in the sugar, oil, 2 cups of flour, and salt.Add the remaining flour 1 cup at a time, mixing well after each addition until a shaggy dough forms and begins to pull into a ball. (You might or might not need the last 1/2 cup of flour. If the dough is very wet or sticky, add it. If not, use some of it to dust your work surface).",
            "Turn the dough out onto a lightly floured work surface. With clean, floured hands, knead the dough until it is smooth and elastic, about 3 minutes. OR don't knead at all - just barely enough to form a ball, then stop. This makes the bread softer. Allow the dough to rest for a few minutes while you clean and dry the large mixing bowl. Grease the inside of the bowl with a bit of oil. Place the challah dough in the bowl and turn to coat with the oil. Cover the bowl with a damp tea towel or plastic wrap and set aside in a warm place until the dough has risen to at least double its bulk, about 1 hour and 45 minutes.",
            "Punch the dough down. Lightly grease one or two baking sheets, or line with parchment paper. Shape or braid the dough as desired. (The recipe will make 1 large challah, 2 medium challahs, 1 medium challah plus 6 challah rolls, or 12 challah rolls.)",
            "Place the shaped challah and/or rolls on the baking sheet(s) and cover with clean, dry tea towels. Allow to rise until doubled, about 45 minutes to 1 hour.",
            "Heat the oven to 350 F. Bake the challah until the crust is a deep golden brown, and the loaf sounds hollow when tapped, about 30 to 35 minutes for a large challah, 20 to 25 minutes for a medium challah, and 15 to 20 minutes for rolls. Cool on a wire rack.",
            "Chocolate challah filling:",
            "Cocoa powder",
            "Oil",
            "Regular sugar",
            "Powdered sugar",
            "Vanilla extract",
            "Can also add: instant coffee, cinnamon"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Mini Mediterranean Tarts (Good for when having people over, like for Shabbat. Simple to make)",
        "Ingredients": [
            "1 sheet of puff pastry",
            "2 tbsp tomato puree",
            "1 tbsp olive oil",
            "1 tbsp balsamic vinegar",
            "Pinch salt",
            "1 tsp black pepper",
            "Toppings:",
            "Courgette (zucchini)",
            "Cherry tomatoes",
            "Kalamata olives",
            "Capers",
            "Sundried tomatoes",
            "Red Onion",
            "Vegan cheese (optional)",
            "Basil (optional)",
            "Soy milk for brushing",
            "Method:",
            "7. Lay the sheet of puff pastry onto a baking tray and cut into six squares. Then score a border onto the inside of the squares.",
            "8. In a bowl, mix the tomato puree, oil, vinegar, salt and pepper to make a sauce. Then spread onto the inner of each square.",
            "9. Put a few of each topping onto each of the squares.",
            "10. Brush the puff pastry borders with soy milk",
            "11. Cook for 15-20 minutes at 180? (356?), or until they begin to look golden brown",
            "12. Serve, they're great hot or cold"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Vegan Kugel",
        "Ingredients": [
            "11/2 teaspoons olive oil",
            "1/2 cup shallots, diced",
            "1 (15-ounce) block extra-firm tofu, drained",
            "2 cups vegan sour cream",
            "2 tablespoons lemon juice",
            "1/2 teaspoon garlic powder",
            "2 teaspoons sea salt",
            "11/2 teaspoons ground black pepper",
            "1 pound wide fusilli pasta, cooked according to package directions",
            "1/2 cup reserved pasta-cooking water",
            "1 (9-ounce) package frozen chopped spinach, thawed and drained well"
        ],
        "Directions": [
            "Preheat oven to 350 degrees.",
            "Into a medium-sized skillet, heat oil over medium-high heat. Add shallots and cook 3 minutes, stirring occasionally, until softened and lightly caramelized.",
            "Into a food processor, add shallots, tofu, sour cream, juice, powder, salt, and pepper. Blend on high until combined and consistency is smooth.",
            "Add the mixture to cooked fusilli pasta and toss well to coat. Stir in reserved pasta-cooking water and spinach.",
            "Onto a prepared 9 x 13 baking dish, add noodles in an even layer. Bake uncovered for 30 minutes. Serve warm or at room temperature."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Cinnamon-Spiced Chickpea & Lentil Stew (for Purim)",
        "Ingredients": [
            "2 tablespoons olive oil",
            "2 medium onions, chopped",
            "2-3 cloves garlic, minced",
            "28-ounce or 2 15-ounce cans chickpeas, drained",
            "3 cups cooked lentils (or 2 15-ounce cans, drained)",
            "28-ounce can diced tomatoes, undrained",
            "1 to 2 teaspoons ground cumin, to taste",
            "1 teaspoon cinnamon",
            "2 teaspoons sweet paprika",
            "Optional seasonings: ground cloves, cardamon, or coriander, fresh ginger or saffron.",
            "2 medium zucchini, diced",
            "1/4 cup dry red wine (optional but highly recommended)",
            "Salt and freshly ground pepper to taste",
            "Dried hot red pepper flakes to taste (optional)",
            "1/2 cup chopped fresh parsley or cilantro"
        ],
        "Directions": [
            "Heat the oil in a soup pot",
            "Add the chickpeas, lentils, tomatoes, cumin, cinnamon, paprika and optional seasonings",
            "Turn up the heat; when the mixture starts to bubble, turn the heat down",
            "Add the zucchini and wine, if using. Cover and simmer gently with the cover ajar for 8 to 10 minutes, or until the zucchini is tender, but not overdone",
            "Season with salt and pepper and add a pinch of dried hot red pepper flakes if you'd like a bit more heat",
            "Stir in the parsley and serve in shallow bowls. You can also let the stew stand off the heat for 30 minutes or so to let the flavors deepen a bit more."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Hamantaschen",
        "Ingredients": [
            "Dough",
            "2 1/2 cups flour",
            "1/2 cup sugar",
            "1 egg's worth egg replacement, mixed up and ready to go",
            "1/4 cup brandy or orange juice",
            "1 tablespoon vanilla extract",
            "approx. 1 tablespoon grated orange zest (from one orange)",
            "pinch of salt",
            "14 tablespoon cold margarine, cut into chunks",
            "Poppy Seed Filling - Pereg (alternative filling below)",
            "1/2 cup sugar",
            "1/4 cup water",
            "1 tablespoon silan/date syrup",
            "1 cup poppy seeds, ground (measure first, then grind in several batches in a clean coffee grinder until powdery)",
            "2 tablespoons lemon juice",
            "approx. 1 teaspoon lemon zest (from one lemon)",
            "1/4 cup raisins"
        ],
        "Directions": [
            "Dough",
            "Combine all ingredients in a food processor outfitted with a blade. Pulse to combine, then process until completely combined and homogeneous, until the dough forms a ball.",
            "Transfer to a plastic bag, or wrap in plastic wrap, and place in the fridge for at least half an hour, up to several days.",
            "For longer storage, freeze, completely sealed and wrapped, for up to two months. Defrost in the fridge.",
            "Poppy Seed Filling - Pereg",
            "In a small saucepan (2 quart/liter) over medium-low heat, combine sugar, water, and date syrup. Cook until sugar is completely dissolved and the liquid is simmering",
            "Add the ground poppy seed and cook a minute longer, stirring. Remove from heat.",
            "Stir in lemon juice, zest, and raisins.",
            "Transfer to a wide mouth container (you'll be scooping the filling directly from the container), and chill in the fridge, at least half an hour, up to a week.",
            "For longer storage, freeze the filling, up to two months. Defrost in the fridge.",
            "Assembly",
            "Removed a quarter of the dough from the fridge at a time. Roll out on a floured surface until 1/8 inch thick.",
            "Cut out circles using a circular cookie cutter or wine glass, 2 1/5 inches in diameter. Transfer the rounds to a parchment paper-lined baking sheet.",
            "Reroll the dough scraps and cut more circles.",
            "Brush the tops of the rounds with water using a pastry brush, about 12 at a time.",
            "Using two spoons, drop a small amount of filling on the center of each round. DO NOT OVERFILL.",
            "Shape the cookies by pinching the dough together, making one corner of the triangle at a time. Pinch and press the seams together well, or else they will open, making very tasty but very flat cookies. If the dough doesn't stick together well, brush more water around the edge of the round.",
            "Fill the parchment paper-lined tray with cookies. They don't grow, so you don't have to leave much room at all, approx 20 cookies/half sheet tray. Transfer the tray to the fridge until the cookies are firm and cool. You can freeze the cookies at this point - freezing them flat on the tray, then transferring them to a container or sealed bag.",
            "Baking",
            "Bake the cookies for 10-14 minutes, until just barely golden, rotating the trays after five minutes.",
            "Transfer to a wire rack to cool completely."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Alternative filling:",
        "Ingredients": [
            "3/4 cup semi-sweet chocolate chips",
            "2 tbsp non-dairy butter",
            "1/2 finely chopped walnuts"
        ],
        "Directions": [
            "Place chocolate chips and butter in a microwave-safe bowl. Heat in the microwave for 20 seconds, then remove from the microwave and mix using a whisk or a fork.",
            "Heat the bowl again for 30 seconds, remove from the microwave and mix.",
            "Heat the bowl for another 10 seconds, remove from the microwave, add the chopped walnuts and mix. Put the bowl in the refrigerator for 10 minutes to let it harden a bit."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Flatbread Stuffed with Fried Onion, Oregano, and Sumac",
        "Ingredients": [
            "Dough:",
            "2.5 cups bread flour",
            "1 1/4 cup lukewarm water",
            "2 t active dry yeast",
            "1 scant tablespoon sea salt",
            "Filling:",
            "1/4 cup olive oil",
            "1 large onion, diced",
            "1 cup oregano leaves; reserve 1 spoonful for garnish",
            "1 T ground sumac",
            "Salt",
            "3 cups olive oil"
        ],
        "Directions": [
            "Dough",
            "Combine all the ingredients in a large bowl of a stand mixer fitted with a bread hook. Mix on low speed until the ingredients are combined and a ball starts to form. Then increase the speed to medium and mix until the dough is smooth and elastic, 10-15 minutes. Cover the dough with a damp towel and let rise in a warm, draft-free area until doubled in volume, about 1 hour.",
            "Punch dough down and divide it into 5 balls. Arrange balls on a baking sheet, cover with a towel, and let rise for 30 minutes",
            "Filling",
            "Heat 1/4 cup olive oil in a skillet over medium heat. Add the onion and saute until soft and golden, about 15 minutes. Stir in the oregano and sumac. Remove from heat and cool completely. Season with salt.",
            "Assembly",
            "Place a ball of dough on a lightly floured surface. Using the heel of one hand, flatten and stretch dough into a rectangle. Lightly dust a rolling pin with flour and roll dough out into a 3x8 rectangle. Spread a fifth of the filling onto the rectangle, then fold into an envelope. Roll dough into 3x8 rectangle with a 1/4 inch thickness. Cute ach rectangle in half then in half again to form 4 triangles. Repeat with remaining dough balls and filling.",
            "To fry",
            "Heat the 3 cups olive oil to 375F in a large heavy pot. Add triangles of dough (in batches, do not crowd) and fry until puffed and golden brown, about 3 minutes per side. Remove from oil using a slotted utensil and drain on towels. Serve immediately."
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    },
    {
        "Name": "Dessert Matzah/Toffee Matzo (for Pesach)",
        "Ingredients": [
            "4-5 lightly salted matzos (preferably the Streit's brand - see note below)",
            "2 sticks (1 cup) unsalted butter",
            "1 cup firmly packed dark brown sugar",
            "1 (12-ounce) bag semi-sweet chocolate chips",
            "1 heaping cup chopped pecans (toasted if desired, for maximum flavor - see note below)",
            "1/2 teaspoon sea salt flakes or kosher salt"
        ],
        "Directions": [
            "Cover the baking sheet with the matzos, cutting and piecing them together as necessary to fill the entire pan.",
            "Make the toffee: Combine butter and brown sugar in a medium saucepan. Cook over medium heat, stirring constantly with a whisk, until the mixture comes to a boil. (If it looks like it's separating, just keep stirring; it will come together.) Once the mixture comes to a boil, continue cooking and stirring for another 3 minutes until foamy and thickened. (Be extra careful -- the toffee will be very hot!) Immediately pour the toffee over the matzos and, using a spatula, spread into an even layer.",
            "Put the pan into the oven and bake for 8 to 10 minutes, or until the toffee topping is crackled and bubbling all over. Remove the pan from the oven and place on wire cooling rack on the counter. Immediately scatter the chocolate chips evenly over top. Wait 3 to 5 minutes for the chips to soften, then use an offset spatula to spread the chocolate into an even layer. Sprinkle with the pecans and sea salt. Refrigerate until the chocolate is firm, about 45 minutes. Don't leave it in the fridge too much longer, otherwise it will be hard to cut.",
            "Lift the foil overhang to transfer the matzo onto a large cutting board. Using a large sharp knife, cut into 2-inch squares. Store in an airtight container in the fridge and serve cold.",
            "Note: I love Streit's lightly salted matzos for this recipe but any brand will work. If you can only find regular salted matzos, cut back or omit the sea salt at the end. If you can't find matzos, substitute Saltine crackers and omit the salt. You'll need enough to cover the entire sheet pan.",
            "Note: It's a good idea to toast the nuts for maximum flavor but, truth be told, I never bother.",
            "Freezer-Friendly Instructions: The toffee can be frozen for up to 3 months: Place the toffee in an airtight container. It can be eaten directly from the freezer or, if you'd like, remove the toffee from the container and let it come to room temperature.",
            "This might just be required because of the high altitude here. I form the balls and put them on the sheet pan and freeze them for 15 mins before i stick them in the oven. They wont spread this way and stay in a cute little ball.",
            "Great idea!"
        ],
        "Type": "",
        "Length": 0,
        "Difficulty": "Easy"
    }
]